{"meta":{"title":"lihan's blog","subtitle":"","description":"","author":"lihan","url":"https://lihanx.com","root":"/"},"posts":[{"tags":[],"title":"linux 常用快捷键","date":"2021/12/15","text":"linux 常用快捷键 ctrl + N : 创建新文件 ctrl + S : 保存当前文件 ctrl + Z : 回退 ctrl + Tab : 切换浏览器标签页 ctrl + W : 关闭浏览器标签页 ctrl + T : 打开浏览器新标签页 F6 : 切换浏览器窗格 shift + F10 : 鼠标右键 super + Tab : 切换运行中的应用 super + D : 回到桌面 Alt + space : 调出命令界面 Alt + F4 : 结束当前应用 ctrl + Alt + T : 启动终端 super + L : 锁屏 super + A : 调出应用菜单 super + M : 打开系统通知信息 super + Arrow keys : 捕捉窗口","permalink":"https://lihanx.com/blog/50709.html","photos":[]},{"tags":[],"title":"文档共享","date":"2021/05/17","text":"好的作品如果不能让作者收益，就应该让读者收益 陶哲轩分析(Analysis I & Analysis II) 第三版 Analysis I : 链接：https://pan.baidu.com/s/1JZ5ObzTtii36_6n3rDovDQ 提取码：1234 Analysis II : 链接：https://pan.baidu.com/s/1ouhplPXZNXpof7q0ui8csg 提取码：1234 范里安微观经济学(英文)第九版 范里安微观9th 链接：https://pan.baidu.com/s/14USuOigkoeJqLC0ZWrBW9A 提取码：1234 平狄克微观经济学(英文)第八版 平狄克微观8th 链接：https://pan.baidu.com/s/1PL6gDSA_KKJ5j3SldZC8rg 提取码：1234","permalink":"https://lihanx.com/blog/44011.html","photos":[]},{"tags":[],"title":"动物精神","date":"2021/04/18","text":"动物精神 作者: 阿克洛夫&席勒 有意自己当家做主的人民，就必须用知识赋予的力量来武装自己。——詹姆斯·麦迪逊 动物精神是凯恩斯解释大萧条的核心理念。 《通论》中的两条根本信息：运用财政赤字摆脱衰退；大多数经济行为源自理性的经济动机，但也有许多经济行为受动物精神的支配。 在凯恩斯看来，这些动物精神是经济发生波动的主要原因，也是非自愿性失业的主要原因。 凯恩斯的幸福家庭论：父母的任务是营造一个幸福的家庭，给孩子自由，同时保护孩子免受动物精神的自配。 新古典主义经济学：凯恩斯主义中残存的为数不多的动物精神可有可无。 本书作者：资本主义经济的运行原理是人们不仅有理性的经济动机，还有各种各样的动物精神。 如果我们不承认那些重大经济事件背后基本上都有人类心理方面的原因，那么就永远无可能真正弄清楚他们的来龙去脉。 古典经济学理论认为：自由市场本质上是完美而稳定的，即便有政府干预，也只需要很少一点。更进一步，政府干预是现在或未来发生大衰退风险的唯一诱因。 本书作者认为：亚当·斯密关于为何有这么多人就业的观点基本正确。在一些特定条件下，亚当·斯密关于资本主义经济优势的观点也基本正确。但是，亚当·斯密的理论不能描述经济体系中为什么存在如此多的波动，也不能解释经济为什么像过山车一样大起大落。 本书作者认为“经济危机是由思维模式的变化引起的”，这与主流经济学背道而驰。 动物精神的5个方面：信心、公平、腐败和反社会行为、货币幻觉、故事。 本书回答的8个问题： 为什么经济会陷入萧条？ 为什么中央银行迄今为止有控制经济的能力？ 为什么有人找不到工作？ 为什么从长期看通货膨胀和失业此消彼长？ 为什么为将来储蓄的决定如此随意？ 为什么金融价格和公司投资如此易变？ 为什么房地产市场具有周期性？ 为什么弱势的少数族裔世世代代在贫困中挣扎？ 方面一：信心 我们所做的大量决策，包括我们生活中最重要的某些决策，都是因为它们“看起来是正确的的”。 信心不仅仅是理性预测，还是动物精神中最重要的元素。 信心会对乘数产生更深层次的影响，其它乘数也高度依赖信心水平。","permalink":"https://lihanx.com/blog/24286.html","photos":[]},{"tags":[],"title":"人和变化","date":"2021/03/27","text":"人和变化","permalink":"https://lihanx.com/blog/9865.html","photos":[]},{"tags":[],"title":"非理性繁荣_2","date":"2021/03/24","text":"非理性繁荣 作者: Robert Shiller 第二篇 文化因素 新闻媒体 新闻媒体全球化 媒体在股市变化中发挥的铺垫作用 争议话题的媒体培养助推 肤浅的观点比深刻的分析更受欢迎，这就是有声媒体的本质 重大新闻不一定会伴随着重大的股价变化 通常情况下，新闻起到连锁事件引发者的作用，最终从根本上上改变公众对市场的看法 新时代与全球泡沫 从全球范围看，“新时代”理论与投机性泡沫总是联系在一起。 我们常常忽略了投资者对新闻的过渡反应，以及价格进一步上涨的反馈环机制。 新时代的经济思想 这些新时代思想是能够产生投机性泡沫的反馈机制的一部分。 1901年的乐观主义：20世纪的顶峰 大谈现有的高科技 大谈商业联合、托拉斯、并购的好处 忽略社会可能无法忍受财富急剧向股东手中转移 天真的认为：股票正被“强有力的手”把持着。认为出现抛售的恐慌是难以想象的。 20世纪20年代的乐观主义 20年代是巨大的技术进步时代 在20年代的公众情绪中，对股市的积极评价具有压倒性优势。 20世纪50年代和60年代的新时代思想 婴儿潮 企业利润的稳定增长 通货膨胀率非常低 对股票的需求相当稳定，足以防止任何下跌 企业能够更好的规划未来 “股市是最佳投资场所”的理论盛极一时 道琼斯指数逼近1000点。新的里程碑的邻近对公众的想象力产生巨大冲击。 20世纪90年代牛市中的新时代思想 全球化发展 高新技术产业的繁荣 低通货膨胀率 利率降低 企业收益提高 生产力增长并不能作为股市会有更好表现的理由，但是90年代报道的生产力增长却被作为解释股市上扬的基础，人们没有意识到生产力增长和股市真实收益之间的联系有多么微弱。 房地产繁荣中的新时代思想 19世纪80年代加州房地产繁荣 1888-1889年加州的房地产价格崩溃 繁荣时的新时代思想：南加州地区气候宜人、未来美好 崩溃后的反思：南加州缺乏坚实的工业基础 1975-1980年加州房地产繁荣 环境保护的政治运动限制了房产的供给 第13条减税建议使得房地产投资更具价值 1984-1988美国东北部地区的房地产繁荣 波士顿新时代故事：高技术中心、悠久的历史文化积淀 人们的普遍观点：一个拥有受过良好教育和文化积淀人口的城市，在当今世界上，会拥有一个美好的未来。 2000年开始的世界许多地区房屋价格迅速上升 这与当前人们对旅游和第二家园的特别偏好密切相关 新时代的终结 尽管投机性泡沫往往意味着股市最终可能暴跌，但与之相伴的新时代思想并不会突然终结。 这么多投资者不可能同时对长期判断作出突发性改变 没有明确的证据表明新时代终结的思想改变是市场衰退的主要原因，人们更多的是从价格变化本身导致的反馈效应来理解的。 新时代终结之际，人们普遍沉浸在悲观的气氛中，市场弥漫的悲观气氛使得听众无法接受乐观的表述。 第三篇 心理因素 股市的心理锚定 用相信市场是理性的，来理解市场，比单纯的市面上流行的心理学理论更为靠谱。 投资者总是努力去做正确的事情，但他们能力有限，当他们无法把握自己行为的准确性时，特定的行为模式就会决定他们的行为。 数量锚：衡量股市定价 道德锚：衡量个人财富投入股市的数量 金融市场中出现的许多异常现象实际上都是由于人们倾向于把参考的数字作为数量锚。 人们从想法到行动大部分并不是基于精确地数量分析，而是喜欢以“讲故事”和“找原因”的简单形式出现。 过度自信和直觉判断 人们认为自己知道的总是比实际的要多，喜欢对自己一无所知的事情发表观点，并在这些观点的指导下采取行动。 要理解投机性泡沫，无论它是正向的还是负向的，我们都必须认识到，人们直觉判断中的过度自信发挥了根本性作用。 脆弱的锚 锚的脆弱性：提前对具有不确定性的未来进行决策相当困难。 非连贯推理过程：人们不能通过得知假设前提事件的发生与否来做出自己的判断。 因此，新闻故事对我们的影响可能更多的取决于我们对新闻的感觉，而不是我们对它的理性反应。 心理锚的崩溃之所以难以预料，人们只有在价格变化之后，才能够弄清楚他们自己的感情和意愿。 从众行为和思想渲染 那些定期进行沟通和交流的人，他们的想法往往很相似；同样的，每个时代都有着自己的时代精神，并且它的影响无处不在。 社会影响与信息 人们乐于信任多数人所持有的或者权威的观点，甚至权威们明显地与理所当然的判断相矛盾时也无所谓。（这是人们从自己的日常经历中汲取的教训，即通常人们的判断和权威人士相悖时，犯错的总是他们） 从众行为和信息瀑布相关的经济理论 事实：当考虑其他人的判断时，完全理性的人也可能会表现出从众行为，即使他们知道其他人的做法也是一种从众行为。 理论研究：这种一窝蜂似的从众行为是由信息瀑布产生的。“两个饭馆”案例可以说明信息瀑布。 面对面交流和媒体传播 人与人之间形成互动的交流会对行为产生最重要的影响，特别是面对面或口头交流。 人与人之间无论转述多么简单的事情都不会完全可靠。 信息传播的股市情节效果的确会对市场价值产生影响。 人们心中矛盾观点汇集 相互矛盾的观点也可以共存于我们的头脑之中，而当支撑这些观点的事实发生变化或公众注意力发生转移时，我们的头脑也许就会突然萌生一种明确的信念。 基于社会的注意力变化 人脑的结构决定了在一个时间点上，人的有意识的注意力只能集中于一个焦点上，并且很快会从一个交点转移到另一个。 注意力的社会基础通过口头交流来运作，并以媒体作为传播观点的载体，从而能在更广泛的范围内激发集中的注意力，这种注意力的聚焦会迅速覆盖世界上大部分地区。 人们无法对自身注意力变化做出解释。 投资者学习和忘却 对风险的“学习” 股票优于债券的“事实”并不存在，股票在某段时间的收益比债券高，在某段时间的收益比债券低，公众并不了解基本事实。 他们至少对于股票的一个重要基本原理不怎么敏感：股票是对公司现金流的剩余索取权，只有在兑付了其他所有债权之后，其剩余部分才属于股票持有人。此外，另一个事实投资者也没有注意到，“没有人能够保证股票一定能赚到钱”。并且，政府对在股市上亏损的人没有任何福利措施。 “股票优于债券理论”在投资文化中的角色 公众相信股票市场的下降趋势最终会被扭转。作者认为，这种信心并非来自对历史的学习，而是因为过去价格上涨的反馈机制加上其他各种诱导因素共同作用形成的。 关于共同基金，分散化投资以及长期持有的学习 股价的下跌也许不是暂时的，它有可能会持续几十年，所以即使是长期投资者也应该认识到股票投资的风险性。这也正是为什么对共同基金的热情被认为是一种投资热，而不是源于对事实的了解。 学习和忘却 公众常被认为学会了，股票在下跌之后总会反弹这个基本知识。但是他们想错了，股市可以下跌，而且可以下跌很多年。 公众常被认为学会了，从长期来看股票总是优于其他投资。但是他们想错了，可能在数十年里，股票并不比其他投资优越。 公众常被认为学会了，股票投资聪明的做法在于选择共同基金，因为它们了解市场的变化。但是他们想错了。选择业绩良好的共同基金所获得的收益比投资者想象中的少。 2007-2009年的金融危机让投资者忘记了“股票是最好的投资”这一“事实”。之后市场估值再次走高时，投资者们会再次学习这一“事实”。","permalink":"https://lihanx.com/blog/27119.html","photos":[]},{"tags":[],"title":"非理性繁荣_1","date":"2021/03/24","text":"非理性繁荣 作者: Robert Shiller 当新的病毒出现或者新的环境因素为传染提供便利时，新的传染病可以在旧的传染病消退时突然爆发。 市盈率：实际价格/年平均收益 滋生市场泡沫的结构性因素 强化投机性泡沫结构的文化因素 市场行为背后的心理因素 学界对市场泡沫理性化的尝试 投机性泡沫对个人投资者、机构、政府的启示 股票市场的历史回顾 1996年12月5日，美联储主席格林斯潘，提及非理性繁荣一词。 周期性调整市盈率(cyclically adjusted price earning ratio, CAPE) 10年平均收益可以熨平由经济周期导致的收益频繁起伏 他就像是一个生活在现代社会里的先知，满口都是模棱两可的哲理。 债券市场的历史回顾 一旦股票市场定价明显过高，就必须拿来与其他市场相比较。 投资者并没有基于他们对未来通胀率的理性预期对债券进行定价。 通胀指数化债券市场能直接反映实际利率。 房地产市场的历史回顾 住房价格： 建筑成本、人口、利率、土地价格。 对大多数人来讲，试图利用房价走势来选择购买住房的有利时机实属不易。 在全球一些知名大城市和相关地区，巨大的房地产泡沫正在形成。透过这些城市的房价泡沫我们可以发现，房地产市场已不止于国家性市场，其已然是一个世界性市场。 大多数住房的实际价格平均增长率并不似人们想象的那么高。 相对于股票市场，住房是一项收益较低的长期投资。 实际房价没有快速上升的原因：市场调节；居民收入增长率形成的限制；政治压力。 地区贷款标准越宽松，房地产泡沫崩溃前房价上涨的越多，泡沫破裂后，回落的也越多。 第一篇 结构因素 诱发因素：互联网、市场经济快速发展以及其他事件 诱发1982-2000年千禧繁荣的12个因素 1.互联网的发展与收益持续增长相映成趣。 就股市繁荣而言，重要的不是互联网革命对于现实生活所产生的无法言喻的深远影响，而是这一革命所引起的公众反应。 2.美国经济必胜的信念和国外竞争对手的衰落。 其他国家的经济衰落，本可以被认为是对美国股市的利空，但是受“只有一个赢家”观念的影响，竞争对手的衰落就被简单的视为利好。 3.政治文化的变迁助力商业的成功。 实用主义的兴起。 4.共和党国会和资本利得税的削减 共和党比民主党更亲商。 5.婴儿潮及其对市场的显著影响 实际上影响股市上涨的最主要因素是，公众注意到了婴儿潮这一现象，而且公众想当然地认为婴儿潮会对股市有正面影响。 6.媒体对财经新闻的浓墨渲染 7.投资分析师日益乐观的预测 分析师不再客观，越来越多的分析师受雇于股票承销公司，预测值往往高于实际增长值。此外，为了迎合企业想看到每季度收益增长高于预期的心态，分析师倾向于发布比实际数字稍低的预测。 2000年10月《公正披露规定》 2002年《萨班斯-奥克斯利法案》 2003年《全球分析师研究协议》 8.固定缴费养老金计划的推广 人们倾向于将养老金配额均匀的分配于各个可选项上，而不是关注每一个可选项的实际投资内容。而401(k)计划提供的选项通常严重地偏向于股票。 9.共同基金的增长 共同基金构成了养老计划的一部分。 10.通货膨胀回落及货币幻觉效应 人们普遍认为通货膨胀率是国家经济和社会机能状况的晴雨表 11.交易量膨胀 12.赌博机会的的增加 诱发2003-2007年次贷繁荣的因素 1.所有权社会 私有产权的理念开始向更大的范畴扩展开来，监管缺失，不安全感上升，买房子提升自己的安全感。 2.支持性货币政策 美联储不采取任何行动阻止次贷繁荣。 诱发2009年后的股市和房地产市场繁荣的因素 1.大萧条恐慌终结 资本评估和压力测试的结果比市场预期要好。 企业削减成本，使得收益开始快速反弹。 2.极度宽松的货币政策和量化宽松政策 美联储收购抵押债券和国债 美联储开始“前瞻指导”政策 3.对失业的焦虑 很多人习惯性的认为关于预期工资收入的负面消息会导致股价下跌而非上升，但经济学理论的观点却恰恰相反。“泰坦尼克号上的救生圈”，人们会将手里的钱进行投资。 4.日益加剧的不平等现象 各个阶层开始对“钱”的疯狂追逐。 5.民族主义和战争动乱 人们缺失安全感，进一步哄抬资产价格。 放大机制：自然形成的庞氏过程 放大机制通过一种反馈环进行 投资者信心的变化 20世纪70年代末：房地产是最好的投资方式 2000年左右：股票是最好的投资方式 人们宁可相信感觉，乐观而自信地相信市场只有震荡，也不愿意相信长期均衡价格的存在。 对投资者信心的思考 投资者中的许多人将注意力，放到了每天报纸上的股市走势图，他们似乎凭直觉感到，股市每次下跌反弹后都会迅速创出新高。 正如reddit /wallstreetbets 中的一个回答:price down, no worry, hold strong, moon soon. 这些关于股票看涨的讨论看似合理，往往缺乏理论支持。 关于预期的调查证据 股市达到顶峰之前，人们的预期往往过于乐观。 股市从巅峰坠落后，人们的预期就不那么乐观了。 对投资者预期和情绪的反思 大多数人对深奥的经济学理论并没有多少兴趣。 人们更愿意认为那些比自己成功的人是运气较好，以此来寻求情感上的慰藉。 尽管进入股市可能失败，然而这种可能的失败远远不如未进入股市的遗憾，所带来痛苦。 市场的不断攀升给投资者带来强烈的心理冲击。 泡沫的反馈理论 发生反馈是由于，过去价格的上涨助长了对价格进一步增长的预期。 通常认为，这种反馈主要是对价格持续增长模式的反应，而不是对价格突然上涨的反应。 投资者对反馈和泡沫的感知 普通的投资者对于泡沫的运行机理并没有清晰的认识。 庞氏骗局：一种特殊的反馈模式和投机性泡沫。 人们很难看到别人赚的盆满钵满时，自己却无动于衷。 欺骗、操纵和善意的谎言 一些人在法律允许范围内，利用市场的繁荣去构建那些连他们自己都不相信的商业活动。 一些公司不惜重金从外面聘请所谓的知名人士来管理公司，以此来取悦股票市场。而那些具有深厚的商业知识功底，为人忠诚，作风稳健的管理者往往不受待见。 投机泡沫的内在庞氏本质 从庞氏骗局到自然发生的投机性泡沫的扩展，看起来是如此的顺理成章。 股票市场与房地产市场 2000年以后股市的下滑，使得一部分投资者的投资热情从证券市场转移到了房地产市场。","permalink":"https://lihanx.com/blog/26799.html","photos":[]},{"tags":[],"title":"To Kill a Mockingbird","date":"2021/03/07","text":"杀死一只知更鸟 作者：Harper Lee 故事发生时间：1933-1935 故事人物： 主人公女孩：Jean Louise Finch (Nickname: Scout) 主人公哥哥：Jeremy Finch (Nickname: Jem) 主人公律师父亲：Atticus Finch 主人公朋友：Dill 影子邻居：Arthur \"Boo\" Radley 法官：Taylor 年轻白人女士：Mayella Ewell 年轻白人女士父亲：Bob Ewell （周围人评价：白人中的垃圾） 警长：Sheriff Tate 我的理解 知更鸟对人们来说没有什么危害，不会在玉米地里筑巢，不会伤害人类，它只是站在树梢上，唱歌，给人们带来愉悦。 这本书的知更鸟有两位，一位是黑人Tom Robinson，一位是白人Arthur \"Boo\" Radley。Tom是一位本分、乐于助人的黑人，他每次路过Mayella Ewell门前时都会向她致意，如果Mayella有需要帮忙的地方，他会乐意帮忙且不收取报酬。但Mayella别有所图，她勾引Tom时被她的酒鬼父亲Bob Ewell发现，一场官司降临到可怜的Tom身上。当地法官Taylor指定Atticus Finch作为Tom的辩护律师，Finch先生不畏当地白人对他的诋毁，尽自己所能，在法庭上揭露真相，Tom是无罪的。 在那个黑奴获取自由近70年的时代里，白人对黑人仍然抱有很深的歧视。最终，陪审团做出了有罪认定，在法庭旁听的Jem对司法的信仰彻底崩塌了。Finch先生决定上诉，不放弃Tom，也不放弃心中的正义。但是，Tom越狱了，开枪的警察失手将Tom打死了。Finch先生获悉，Tom像疯子一样奔跑，也许Tom对司法彻底失望了，他不曾伤害任何一个人，他想要的仅仅是他应有的自由，但那些陪审团的白人不会站在Tom的角度考虑问题，在这些人眼中，Tom就是一个低等的黑鬼，竟\"试图\"染指他们“纯洁”的白人女性，仅仅是将黑人男性与白人女性联系在一起，就足以让这些白人失去理性，像保护自己领地的野狗，疯狂的进行攻击，报复。 Tom死了，在法庭丢尽脸面的Bob Ewell不肯罢休，他将怒火冲向了Finch先生一家。Bob Ewell向Finch先生脸上吐了一口唾沫，又趁机在晚上袭击Scout和Jem，幸亏Boo及时赶到，制止了酒鬼Ewell继续行凶。Boo将昏倒的Jem抱回了家，幸好只是骨折而已。随后赶来的Tate警长带来了一个消息，Bob Ewell死于一柄刀子之下，事实很显然，Jem、Boo都有责任。警长看了看Boo，他在人前是那么的紧张，不知所措，如果到了法庭上，他会是下一个Tom吗？警长告诉Finch先生，他会告诉人们，Bob Ewell是死于自己的刀子之下。一个知更鸟死了，难道还要更多的知更鸟死于人类的罪恶之中吗？ Sout送Boo回到了他自己的家中，从此，Scout再也没有见过这只怕见人的知更鸟。Scout站在Radley家的走廊上，从Boo的视角，想象着他的生活。 知更鸟从不打扰人们的生活，也请人们不要伤害知更鸟。","permalink":"https://lihanx.com/blog/42300.html","photos":[]},{"tags":[],"title":"压榨农村","date":"2021/03/06","text":"压榨农村 伴随着资本的快速增长，趁着文艺复兴的东风，人类文明迈入了一个新时代。机器的大量出现，使得人类的生产力得以快速的提升，但生产力过剩了。人类应该算是这个星球上适应能力比较迟钝的了，我们知道基因突变可以帮助我们适应环境，但是我们的个头很大，基因含量很多，短期内的突变对我们的改变微乎其微，这与那些RNA病毒的区别就很明显。我们很难快速的跟上生产力的变化，直接的反映就是消费不足。所以资本需要消费，消费需要市场，先发展起来的资本开始寻找更大的市场，更多的消费。 荷兰、葡萄牙、西班牙、英国，这些欧陆沿海资本强国，开始了他们开拓市场的旅程。印度、中国、中东、非洲、美洲，直到全世界所有的角落都被卷入资本的漩涡之中。最后，全世界的目光都被资本深深的吸引，只有一群人被遗忘了，这就是农民。 农民在这个世界上一直占有重要的地位，这需要从更远的历史来看。原始社会人们成群结队的生活在这颗星球上，自由，没有压迫，但是有忧愁也有顾虑，忧虑各种飞禽走兽打扰自己的生活、忧虑别的族群对自己烧杀抢夺。在这个绝对自由的环境中，他们大多数时间都不快乐，直到农民的出现。农民的出现带给了人类前所未有的安全感，他们一次收获，全年都在放假，不用再辛苦的捕猎了，他们有时间建造自己屋子，自己的围墙，他们最终在这颗星球上建起了一个个村落。这时的农民生产着这个世界绝大多数的财富，士农工商，耕读传家，无一不在昭示农民当年的辉煌。 这一切怎么就突然变了呢？也许农民们也不清楚，正是他们的勤劳，将农民这个职业推下深渊。有农业知识的朋友知道，一个人如果能有两亩地，在古代，娶妻生子，日子也能无忧。有一个事实，人在闲下来的时候总想找人说会儿话，唠唠嗑，所以他们开始扎堆了，农民在某个有水的地方越聚越多，城市出现了。城市带来了各行各业的繁荣，说的更直接一些，手工业，和服务业得到了快速的发展。 四大文明古国为什么不能引领资本狂潮，率先进入工业社会？因为皇权太过强大。以中国为例，自从秦始皇统一中国，到1840年鸦片战争。中国农民的生活并没有多大的改善，中国的科学进步仅限于天文历法，中国的哲学思想再也不能超越春秋战国时代。隔壁日本总是说自己“失去的十年”“失去的二十年”，而中国是“失去的两千年”。在皇权较弱的欧陆诸国，他们无意之间突破了皇权的桎梏，伴随着蒸汽机的轰鸣，欧洲的皇权统治的根基开始松动。最终，在第二次工业革命的推动下，全世界的皇权都走向了末路。 农民主动权的丧失。工业产品涌入一个农业社会，意味着原来自给自足的农民需要更多的劳动才能换来自己“所需的”工业品。农民开始更加努力的劳动，生产更多的粮食，换取工业品，结果，农民被锁在了土地上。资本增长的速度是惊人的，农民的粮食产量受限于耕地面积，单位亩产等天花板级的限制，农民的财富比例越来越低。为什么农民粮食价格上不去？因为农民之间是竞争关系，这种竞争关系导致农产品价格不可能在粮食足够的情况下快速提升。社会在进步，农村也在进步，虽然农村生产效率提高了，但是单位亩产和耕地面积限制产量，社会发展的越快，农民的财富占比就会降低的越快。 农民的出路。1.阻止城市资本进入农业用地流转市场。2.大规模减少城市别墅用地。3.住宅私有化，用具有永久产权的宅基地吸引城市富人购置土地，进入城市生活。4.进城打工。 农民再次被压榨。第一步，农村土地改革，将农业用地分为所有权、承包权、使用权。在资本几百年的发展史中，我们得到了一个事实，原始资本的积累是缓慢的。使用权会被什么人取得呢？恐怕不是基层农民，而是城市资本。这种改革不仅不会使农民增收，还会让农民失去土地的控制权，即这块土地上生产的粮食卖给谁。所以说，农业用地即使使用权不在农民个体手中，也应该在国家手中，而不应该在城市资本手中。第二步，电商接管农村，同时具有农村和城市生活经验的都知道，蔬菜水果，农村和城市的价格差了好几倍。城市卖的贵很大的原因是门店租金贵，在城市建一座生鲜超市，本身的成本就非常高，但是在城市建一座仓库，成本就会低很多。那么电商的到来会使城市蔬菜价格下降吗？答案已经很明白了，不会。我们看看美团买菜、叮咚买菜等卖菜电商，他们的价格并不比生鲜超市低。他们不需要门店，不需要超市收银员，只是雇几个快递员就可以了。从农村到城市，成本降低了，价格没有降低，谁获利了？农民吗？不是。消费者吗？不是。获利的是电商。 多家电商会竞争吗？电商之间肯定会竞争，但这并不意味着价格下降。中国各个公司背后的资本错综复杂，相互之间有着千丝万缕的联系，很难保证他们不会形成卡特尔组织。更加危险的是，生鲜电商之间的竞争很可能复制当初外卖行业的百团大战，绝大多数的小公司会被资本的力量压垮，当市面上仅剩下两三家时，他们就会心照不宣的达成某些共识，形成对整个市场的垄断，肆无忌惮的攫取垄断利润。消费者、生产者都被这个所谓的平台挟制，顺者生，逆者亡，无耻战胜正义。这时候，就算是国家也很难将他们连根拔起，因为这涉及就业，涉及整个产业链，涉及社会的稳定。 城市的消费者是谁？难以置信，城市中很大一部分消费者是农村出来打工的。一个从农村来的农民，吃着比以前在农村贵好多倍的蔬菜，从自己承包的土地上长出来的蔬菜，自己没有丝毫获利，这不讽刺吗？ 可以预见的未来，如果农村住宅不进行私有化，且电商在农村大行其道，全国所有普通农民都必须脱了裤子[扯下遮羞布]，奔向城市，享受高物价、高房价的打击，或者选择留在农村，慢慢消失[没有结婚对象，族群消失]。","permalink":"https://lihanx.com/blog/23005.html","photos":[]},{"tags":[],"title":"List of java problems","date":"2021/02/02","text":"List of java problems java:5: 错误: 编码 GBK 的不可映射字符 (0xA8)??? 参考： https://www.cnblogs.com/FlyAway2013/p/12115243.html javac的-encoding参数是相当关键的，默认是系统编码，windows就是GBK！所以当我们设置java源码文件编码为utf-8，然后编译的时候需要注意设置javac的 -encoding参数!! 具体措施： javac -encoding UTF-8 file_name.java","permalink":"https://lihanx.com/blog/5503.html","photos":[]},{"tags":[],"title":"powershell基本命令","date":"2021/02/02","text":"powershell 基本命令 cd 改变工作空间位置 clear 清屏 ac 追加内容[例如向一个文件中追加文字或数据] cat 显示文件内容 clc 清除项目内容 cp 拷贝项目 ls 显示子项目 md 新建项目 mv 移动项目 rm 删除项目 rni 重命名项目","permalink":"https://lihanx.com/blog/49994.html","photos":[]},{"tags":[],"title":"道德狂欢","date":"2021/01/25","text":"道德狂欢 人们把主宰世界的力量，叫作权力。把看起来破坏性较大的权力约束起来的东西叫作法律；把看起来破坏性较小的权力约束起来的东西叫作道德。法律权力的获取难度很大，而且在法治健全的地方上，处处受到制衡。唯有道德权力，不受任何制衡，得到它就能完全主宰人们的前途命运。正直而有远见的人担心拥有这样的权力，他们担心因为自己不经意间的错误毁坏他人的前途命运；贪婪而卑劣的人渴望拥有这样的权力，它们渴望成为“人上人”，人类主宰世界，他们要主宰人类。 回到2021年的一月份，郑爽事件刚刚爆发两天，各种机构开始发文谴责，甚至直言要封杀郑爽，一派正气凛然的样子，像是天使之神驾临人间。天使之神来了吗？恐怕天使的面具之下是贪婪、是无耻、是吃人肉的恶魔。真正有道德的人不会轻易断送当事人的前途，也不会因为一件还没弄清前因后果的事件，“封杀”他。 这些机构已经丧失了分析事件的能力，通篇能看到的只是情绪、情绪。一个很多人都知道的道理，越是艰深的道理，乐意去听的人就越少。当今社会，人们都有一个共同的特征，那就是“忙”。忙事业，忙家庭，还有就是忙着从上一个热点到下一个热点，生活如此之忙，哪还有时间去了解前因后果，也没有必要去了解前因后果，这些热点对于人们最大的作用就是发泄、发泄。 狂欢派对开始了，这是一场道德的狂欢。道德，谁在乎呢？反正是一场狂欢派对就好了。谴责、谴责，谩骂、谩骂，还有什么时候比现在更令人感到惬意呢？","permalink":"https://lihanx.com/blog/14328.html","photos":[]},{"tags":[],"title":"通往奴役之路摘选_4","date":"2021/01/23","text":"The Road to Serfdom 作者：弗里德里希·奥古斯特·冯·哈耶克 首次出版年份:1944年 文中的我们：指英国人 第十章 为什么最坏者当政 所有权力都易腐化，绝对权力绝对会腐化。---阿克顿勋爵 一种看法：极权主义政权是由流氓和杀人犯集团建立起来的。 我们绝不应该自欺的的相信，一切善良的人们都一定是民主主义者，或者说，必然会愿意参与政府工作。 着手于计划经济的民主主义政治家很快就会面临这样的选择：是僭越独裁权力，还是放弃他的计划，而极权主义的独裁者不久必定会在置一般的道德于不顾和遭受失败之间做出选择。 在一个有计划的社会里，问题已不再是大多数人同意的是什么，而是其成员的一致性足以使一切事情都服从统一指导的那个集团是哪个集团；或者，如果没有大的足以贯彻它意见的集团的话，那么，问题就是如何能够建立这样的一个集团，以及谁能够把它建立起来。 这样的一个集团，只能由最坏的分子来建立，这其中有三个主要原因： 一般来说，各个人的教育和知识越高，他们的见解和趣味就越不相同，而他们赞同某种价值等级制度的可能性就越少。 价值标准极为类似且人数最多的集团，是具有低级标准的那些人。 一个潜在的独裁者将能够得到一切温驯和易受骗之人的支持，这些人没有自己的坚强信念而只准备接受一个现成的价值标准体系，只要大声地、喋喋不休地向他们鼓吹这种体系就会就范。壮大极权主义政党队伍的，正是那些思想模糊、不健全并容易动摇的人以及那些感情与情绪容易冲动之人。 人们赞同一个消极的纲领，即对敌人的憎恨、对富人的嫉妒，比赞同一项积极的任务要容易些。若要用一个信条将某个集团牢牢的团结在一起以便共同行动的话，那么，将“我们”和“他们”对立起来，即与一个集团以外的人进行共同斗争，则似乎是这个信条中的重要组成部分。 集体主义的门户之见 什么样的社会主义者会认真地期望把现在的资本资源平均分配给全世界人民呢？ 集体主义哲学的内在矛盾之一是，虽然它将自身建筑在个人主义所发展起来的人本主义道德基础之上，但它只能够在一个比较小的集团里行得通。社会主义只有停留在理论层面时，它才是国际主义的，但一经付诸实施，无论是在德国还是俄国，它就会马上变成强烈的民族主义。 如果“共同体”或国家比个人更重要，如果他们的目标独立于个人目标并超越个人目标的话，那么，只有那些为社会所具有共同目标而努力的个人才能被视为该社会的成员。这种见解的必然结果就是：一个人只因为他是那个集团的成员才受到尊敬，也就是说，只有他为公认的共同目标而工作才受到尊敬，并且他只是从他作为该集团成员的资格中获得他的全部尊严。单纯依靠他作为人的资格却不会带给他什么尊严。 助长集体主义门户之见的一个重要因素是，常常是一种自卑感引起的个人认同于一个集团的愿望。因而，只有那个集团的成员资格能够使他比这个集团之外的人有优越性，他的需要才会满足。 就小国的权利而论，马克思和恩格斯的见解也不比大多数其他坚定的集体主义者好多少，他们时而发表的关于捷克人或荷兰人的见解和当代的国家社会主义者的见解如出一辙。 事实：集体主义者为了达到他们的目的，必须建立起前所未有的巨大权利，人支配人的那种权利，并且他们的成功也取决于他们取得这种权利的程度。 竞争制度就是旨在用分散权力的办法把人用来支配人的权力减少到最低限度的唯一制度。 用目的说明手段正当性的原则，在个人主义道德里面被认为是对一切道德的否定，而它在集体主义道德里面必然成为至高无上的准则，因为“整体利益”是他们判定应当做什么的唯一标准。 哪里存在着一个凌驾一切的共同目标，哪里就没有任何一般道德或规则的容身之地。 要成为一个对极权主义国家有用的助手，一个人单单准备接受那些为可耻行径辩护还是不够的；他自己还必须积极地准备破除它所知道的任何一种道德的约束，如果这对达到为他们所设定的那个目标似乎有必要的话。 第11章 真理的终结 思想的国有化总是与工业的国有化并驾齐驱的，这是值得玩味的。——E.H.卡尔 在一个极权主义国家里，完全改变了宣传性质和效果的事实是：一切宣传都为同一个目标服务，所有的宣传工具都被协调起来朝着一个方向影响个人，并造成了特有的全体人民思想“划一化”。 如果所有时事新闻的来源都被唯一一个控制者所有效掌握，那么，灵巧的宣传家就有力量照自己的选择来塑造人们的思想趋向。如果被长期地和其他一切信息来源隔绝的话，连最明智和最独立的人民也不能完全逃脱这种影响。 极权主义宣传侵蚀了所有道德的基础之一，即对真理的认识和尊重。 篡改说明政治理想词义的行为不是一个孤立事件，而是一个连续性的过程，是一种有意识或无意识地用来指导人民的技巧，所以，这种混淆会变得更加严重。随着这种过程的继续演进，全部语言的意义逐渐被剥夺而文字则变成了空壳，失去了任何具体的内容；他们既可以表示一件事务的正面，又可以表示它的反面，它们之所以被使用仅仅是因为附着在它们身上的感情联系。 对于信条的公开批评，或者甚至表示怀疑都是必须禁止的，因为它们容易削弱公众的支持。 使思想获得生命的，是具有不同知识和不同见解的个人之间的互动。理性的成长就是以这种差异为基础的社会过程。这种成长的本质就是它的结果难以预料。 集体主义思想的悲剧在于：它起初把理性推到至高无上的地位，却以毁灭理性而告终，因为它误解了理性成长所依据的那个过程。 个人主义在社会过程面前的态度是谦恭的，而对其他意见的态度则是宽容的，并且，它恰好是思想上傲慢自大的对立面，而想全面指导社会过程的根源，正是这种思想上的傲慢自大。 本书有15章，前面11章时理论分析，最后4章是对当时社会的分析、展望。最后4章的章节名称如下： 第12章 纳粹主义的社会主义根源 第13章 我们中间的极权主义者 第14章 物质条件与理想目标 第15章 国际秩序的展望 总结 无论什么样的社会制度，它的先进性在于是否保障了个人自由。","permalink":"https://lihanx.com/blog/59731.html","photos":[]},{"tags":[],"title":"通往奴役之路摘选_3","date":"2021/01/16","text":"The Road to Serfdom 作者：弗里德里希·奥古斯特·冯·哈耶克 首次出版年份:1944年 文中的我们：指英国人 第7章 经济控制与极权主义 对财富生产的控制，就是对人类生活本身的控制。——希莱尔·贝洛克 经济价值对于我们之所以没有许多东西那么重要，正是由于在经济事务上，我们能够自由决定什么对我们比较重要，什么对我们比较次要的缘故。 经济计划所引起的问题，并不仅仅是我们是否会按照我们所喜欢的方法满足我们认为是重要或不太重要的问题，而是是否会由我们自己来决定什么对我们是重要的和什么是次要的、或是否这必须由计划者来加以决定的问题。 在一个有计划的社会中，当局所掌握的对所有消费控制权的根源就是它对于生产的控制。 在一个竞争性的社会中，我们的选择自由是基于这一事实：如果某一个人拒绝满足我们的愿望，我们可以转向另一个人。 虽则公开宣布计划的目标是，人应当不在仅仅是一个工具，而事实上，由于在计划中不可能考虑到个人的好恶，个人之仅仅作为工具将比以往有过之而无不及。 生命与健康、美与善、荣誉与心灵的安宁，往往只能以相当的物质牺牲为代价才能得以保存，并且还必须有人做出选择，这一点是不能否认的，正如我们每一个人有时并不愿意，不惜忍受物质上的牺牲以保全这些高尚的价值，使之不受伤害。 为了实现某些人的公平理想，我们必须付出的代价，较之受到众多攻击的自由竞争所引起的后果，是否一定不会造成更多的不满和压制呢？ 人们往往说，没有经济自由的政治自由是没有意义的。这当然很对，但在某种意义上，它是和我们的计划者使用这句话的意思几乎相反。作为任何其他自由前提的经济自由，不可能是那种社会主义者允诺给我们的免于经济劳心的自由，也不可能是只通过同时解决个人必需问题和免除个人选择权才可获得的自由；经济自由必须是我们经济活动的自由，这种自由，因其具有选择的权利，不可避免地也带来与那种权利相联系的风险和责任。 第8章 谁跟谁？ 对平等的热衷，使自由的希望落了空，曾经赋予这个世界的大好机会因而被抛弃。——阿克顿勋爵 对竞争所持的最普通的异议中，有一种异议认为竞争是“盲目的”。 单纯认为存在的两种制度：(1)每个人都按照绝对和普遍的权利标准来得到它应得的份额；(2)他所应得份额部分的应有偶然事件或幸与不幸来决定。 事实上，可供我们选择的是下面两种制度：(1)谁应该得到什么是由几个人的意愿来决定；(2)谁应得到什么至少部分地是靠他们的才能和进取心，部分地是靠难以预测的情况来决定。 事实：在竞争的社会里，穷人的机会比受到限制的富人要多得多。【原书翻译有问题】 事实：在竞争的社会里，穷人比在另一种社会里拥有很大物质享受的人要自由的多。 事实：在英国这个国家里，一个待遇很差的非技术工人，比德国的许多小厂主，或俄国待遇很高的工程师或经理享有更多的自由去计划自己的生活。 事实：大多数社会主义者的公平理想只满足于取消私人财产权而得到的收入，而对于不同人所得到的收入差别则听之任之。 私有制是自由的最重要的保障，这不单是对有产者，而且对无产者也是一样。只是由于生产资料掌握在许多独立行动的人手中，才没有人有控制我的全权，我们才能够以个人的身份来决定我们要做的事情。如果所有的生产资料都落到一个人手里，不管它在名义上是属于整个“社会”的，还是属于独裁者的，谁行使这个管理权，谁就有全权控制我们。 政府一旦负担起筹划整个经济生活的任务，不同的个人和集团都要得到应有地位这一问题，事实上就一定不可避免成为政治的中心问题。由于只有国家的强制权利可以决定“谁应得到什么”，唯一值得掌握的权利，就是参与行使这种管理权。一切的经济或社会问题都将变成政治问题，因为这些问题的解决，只取决于谁行使强制权利，谁的意见占有优势。 一切政府的问题，“谁得到什么，何时得到，如何得到”。 社会主义所允诺的不是绝对的平等，而是一种更加公平，更加平等的分配。 “较大的平等” VS “绝对的平等” 绝对的平等可以清晰地确定计划者的任务，那么要求较大的平等却只是消极的，不过是对现状不满的一种表示而已。 证明某种计划是正当的这一工作所需要的不是合理的说服而是接受信条。其实，各地的社会主义者都最先承认：他们所承担的任务要求普遍承认一个共同的世界观，一套明确的价值标准。 这个中产阶级的下层，也就是法西斯主义和民主社会主义从中获得很大一部分支持者的那个阶层，给其不满火上浇油的是下面这个事实：他们所受的教育和训练，在很多场合下使他们对领导地位怀有渴望，他们认为自己有资格成为领导阶级的一员。 法西斯主义和民主社会主义知道，一个强大的集团，集合了足够的支持者拥护一种新的社会等级秩序，同时又对它所号召的那些阶层公开地许以特权，它是易于获得所有失望者的支持的。这些人起初曾获实现平等的许诺，但后来会发现，他们只是促进了某个阶层的利益。最重要的是，它们之所以成功，是因为它们提供了一个理论，或者一个世界观，这个理论或世界观似乎足以证明他们所许诺向其支持者提供的那些特权是正当的。 第9章 保障与自由 整个社会将成为一个同工同酬的管理处或报酬平等的工厂。——列宁于1717年 在一个国家里唯一的雇主的国度里，反抗就等于慢慢地饿死。“不劳动者不得食”这个古老原则，已由“不服从者不得食”这个新的原则所代替。——托洛茨基于1937年 经济保障，像杜撰的“经济自由”一样而且往往是更有理由被人看成是真正自由所不可或缺的条件。 保障1，有限度的保障，它是大家都能获得的。防止严重物质匮乏的保障，即确保每个人维持生计的某种最低需要。（最低收入保障） 保障2，绝对的保障，某种生活水准的保障。（特定收入保障） 凡是能够减轻个人既无法防范又不能对其后果预做准备的灾祸的公共行动，都无疑是应当采取的。 大规模事业问题？ 虽则解决这个问题需要大量合适的计划，但它不需要那种代替市场的计划。无论如何，我们为保护经济活动不遭受这些波动做出的必要努力，应是并不会导致对我们自由构成威胁的那种计划。 尽管一个人努力工作，尽管他有特殊的技能，但他却会受到不是他过失造成的收入急剧减少的痛苦和失望，这无疑是有伤我们的公正感的。 如果允许人们有自行选择职业的自由的话，那么，就不能够给予一切人以一定收入的保障。并且，如果给一部分人提供这种保障，那它就会成为一种特权。 事实上，除非与自己的利益直接相关，不然的话，世界上的人们是不大可能做出最大努力的。 随着每一次把完全的保障赐予某个集团，其余人的不安全感就必然增加。 重要的是，我们应当重新学习并坦然面对这一事实：只有付出代价才能得到自由，并且，就我们个人来说，我们必须准备作出重大的物质牺牲，以维护我们的自由。","permalink":"https://lihanx.com/blog/11026.html","photos":[]},{"tags":[],"title":"通往奴役之路摘选_2","date":"2021/01/12","text":"The Road to Serfdom 作者：弗里德里希·奥古斯特·冯·哈耶克 首次出版年份:1944年 文中的我们：指英国人 第4章 计划的“不可避免性” 是我们首先主张，文明的形态越复杂，个人自由也必定变得越受限制。 —— B·墨索里尼 很少有计划者甘愿说集中计划是他们心甘情愿的。 计划“不可避免性”的几种说法如下： 人们认为，大规模生产具有更高效率的观点是使竞争消失的原因。 1941年美国“全国经济临时委员会”得出结论是“从现有的任何证据中很难得到支持”。 过去60年或80年的思想发展史就是说明这样一个真理最好的例证：在社会演化中，没有什么东西是不可避免的，使其成为不可避免的是思想。 我们现代工业文明的复杂性产生了一些新的问题，除了集中的计划以外，我们不能希望有效的加以处理。 这在一定意义上是对的，但是在他们所主张的那种广泛的意义上则不然。事实上，整体越复杂，我们就越得凭借在个人之间分散的知识，这些个人的个别行动，是由我们叫做价格体系的那种用以传播有关消息的非人为的机制来加以协调的。 现代技术破坏了竞争，除非给予保护使他免受竞争的影响，就是说，除非给予垄断权，否则便不可能利用许多新技术的潜力。 我们必须承认：通过强制的标准化或禁止超出某种程度的多样性，在某些领域中富裕的程度可能会增加到足以补偿对消费者的选择限制且有余。 但可以肯定的说，相关例子并不足以成为可以合理声言技术进步使集中管理成为不可避免的例证。这些事例仅仅说明，有必要在下列两者之间有所选择：(1)通过强制获得某种利益，(2)或者是无法获得某种利益（大多数情况下，是迟到一点得到，即等到技术的进一步发展克服了特殊的困难时） 为什么这么多的技术专家竟会居于计划者的前列？ 有一个重要的事实不能忽视，如果我们使那些专家的技术理想成为人类的唯一目标，则几乎每一个理想都能够在比较短的时间内实现。 我们所了解的有计划或半计划社会确实提供了恰好的例证，说明这些国家的人民所享有的那些好事完全是由计划产生出来的。德国和意大利的那些壮观的公路是常常被引用的例子。但是引用这种某一方面技术上高超的事例来证实计划的普遍优越性也同样是不明智的。这样说也许更正确：这种和一般条件不相适应的非凡技术的卓越成就，是资源被误用的证明。 所有的人都知道他们的目标只有通过计划才能充分实现。不过采用他们所叫嚣强求的社会计划，当然之能把他们的目标之间潜伏的冲突暴露出来。 他们寄托于计划的希望并不是对社会全面观察的结果，并且常常是大大夸张了他们所重视目标的结果。虽然失望的专家的激愤强有力的推动了对计划的要求，但如果让世界上每一方面最著名的专家毫无阻碍地去实现他们的理想，那将在没有比这个更难忍受和不合理的世界了。 民主与计划 试图指导私人以何种方式运用其资本的政治家，不仅其本人是在枉费心机，而且也是在僭取一种无论如何也不能安心授权给枢密院和参议院的权利；由一个愚蠢和专断到幻想自己是适于行使这种权利的人掌握它，是在危险不过了。 ——亚当·斯密 迄今为止，随着文明的发展，个人行动受到成规束缚的范围在不断的缩减。 有一个基本事实：任何人都只能考察有限的领域，认识有限需要的迫切性。无论他的兴趣以他本人的物质需要为中心，还是热衷于他所认识人的福利，他所关心的种种目标对于所有人的需要而言，仅仅是九牛一毛而已。 我们不能无限的扩大公共行动领域而扔让个人在其自己的领域中自由自在。 民主议会在贯彻人民似乎明确授权方面的无能为力，将不可避免导致对民主制度的不满。 一个民主的议会，像商议普通议案那样对一个全面的经济计划逐款进行表决和修改，是毫无意义的。如同军事战略一样，这个任务不可避免的要受给专家。 计划者们试图说服我们的论点是：只要民主政体仍然保持最终的控制，民主的本质就不会受到影响。 这种信念忽略了一个致命的差别。在议会首先能就目标达成一致，而且仅仅授予解决细节之处的权利时，议会当然能够在其能给予明确指导的地方控制任务执行。当授权的理由是由于对目标没有达成一致的时候；当负责计划的机构不得不在议会意识不到其冲突的种种目标之间进行选择的时候；当充其量能做的是提供给它一个只能全盘接受或全盘拒绝的计划时，情形就完全不同了。 有意识控制的可能性只限于存在真正一致的领域之中，而在一些领域中必须听凭运气，这就是民主的代价。 现在人们常常说，民主不会容忍“资本主义”。倘若此处“资本主义”意味着以自由处置私有财产为基础的一个竞争体质的话，那么，认识到只有在这种制度下民主才有可能，是极其重要的。当这个制度由集体主义信条支配时，民主将不可避免的自行毁灭。 民主本质上是一种手段，一种保障国内安定和个人自由的实用装置。它本身绝不是一贯正确的和可靠无疑的。 计划与民主之间的冲突只不过起因于这样一个事实，即对指导经济活动所需的对自由的压制来说，后者是一个障碍。但是，只要民主不再是个人自由的保障的话，它也可能以某种形式依然存在于极权主义政体之中。 把民主看成受到威胁的主流价值，而专心于此的流行做法，并非不存在危险。民主的控制可能会防止权利变得专断，但并非仅仅存在民主的控制就能做到这一点。如果民主制度决定了一项任务，而这项任务又必定要运用不能根据定则加以指导的权利时，它必定会变成专断的权利。 第6章 计划与法治 近年来关于法律社会学的研究再一次证实：成文法的基本原则只有在资本主义自由竞争的阶段才能得到适用。根据这种原则，每一个案件的审理，都必须依据具有一般性的理性规则，这种理性规则把例外的情形减少到最低限度，并以某些逻辑前提为基础。—— 卡尔·曼海姆 最能清楚的将自由国家与专制国家状态区分开的，莫过于法治了。撇开所有技术细节不论，法治的意思就是指政府在一切行动中都受到事前规定并宣布的规则的约束。法治的基本点：即留给执掌强制权利的执行机构的行动自由，应当减少到最低限度。 集体主义类型的经济计划必定要与法治背道而驰。计划当局要根据人民需要，做出选择，必须将人们的需要区分出尊卑轻重。这些观点也就必定成为那个国家法律的一部分，由此政府强制工具强加于人民一种新的等级差别。 形式规则(法律) VS 实体规则 形式规则：事先告诉人们在某种情况之下，政府将采取何种行动。 这两种规则的区别就像设置路标与命令人民走哪一条路之间的区别一样。 如果说在某一个制度之下，我们对于政府所采用的措施的具体效果要比在大多数其他制度下了解的少是个优点，并且认为，某一社会控制方法是较好的方法，因为我们不知道它的具体效果，这似乎是很荒谬的。但是这种考虑实际上是法治这一伟大的自由主义原则的理论基础。 经济方面，简短的说明一下。政府“计划”得越多，个人计划就变得越困难。 道德或政治方面。如果政府要精确地预见到其行动的影响，那就意味着它可以不让受影响的人有任何选择的余地。如果我们要创造新的对一切人都开放的机会，要给人们提供他们能够随意加以利用的机会的话，那么其精确地结果就是难以预见的。不偏不倚，指对一定问题没有答案。在一个每件事都能精准预见到的社会里，政府很难做一件事而保持不偏不倚。只要政府政策对某种人的精确影响是已知的，它必有所偏袒，将它的评价强加于人民。政府不在是一个旨在帮助个人充分发展其个性的实用机构，而成为一个“道德”机构。这里的“道德”不是“不道德”的反义词，而是指这样一个将自己对于一切道德或不道德的观点都强加于其成员的机构。 有人认为这并不会导致严重的后果，因为经济计划者能够凭借关于公平及合理地一般信念。在某一特定问题上最直接有厉害关系的人，并不一定是全社会利益的最好判断者。如果我们要检验在解决经济计划工作中产生的那类问题时公平原则是否有用，我们必须把该原则应用所得和所失同样看得清楚的某种问题中去才行。在这种情况下，很容易认识到：并没有什么如“公平”之类的一般性原则可以给我们提供答案。 实际上，由于计划工作的范围越来越广泛，就经常需要越来越多的参照什么是“公平的”或“合理的”来限定法律条款。这种情况下，法律和司法不得不成为政策工具。无疑，计划必然要涉及对不同人的具体需要予以有意识的差别对待，它必须通过法律规则来规定，某一种人处境应如何富裕，和允许各种人应当有什么和做什么。这就意味着实际回到身份统治的局面。 正是形式法律这一意义上的法治，也就是不存在当局指定的某些特定人物法律上的特权，才能保障在法律面前的平等，而这是专制政府的对立物。 社会主义者常常反对“纯粹的”形式上的公平，要求“法律社会化”，攻击司法的独立。 有一种观念认为自由主义的典型态度是政府的无为。而“自由放任”一词是对于自由主义政策所依据原则模糊不清、容易引起误解的描述。 每一个政府当然必须有所行动，重要的问题是个人能否预见到政府的行动，并在制订自己的计划时，以这种了解为依据，其结果是政府不能控制公众对于政府机构的利用。 “如果一个人不需要服从任何人，只服从法律，那么他就是自由的”。 有一种信念是，只要政府的一切行动都经过立法机关正式授权，法治就会被保持下去。然而，这是对于法治意义的完全误解。 如果说，在一个有计划的社会，法治不能保持，这并不是说，政府的行为将是不合法的；它只是说，政府强制权利的使用不在受事先规则的限制和决定。 特定的立法能够破坏法治。 在一个经济生活受到彻底管制的国家中，甚至形式上承认个人权利或少数人的平等权利都会失去任何意义。","permalink":"https://lihanx.com/blog/60371.html","photos":[]},{"tags":[],"title":"通往奴役之路摘选_1","date":"2021/01/07","text":"The Road to Serfdom 作者：弗里德里希·奥古斯特·冯·哈耶克 首次出版年份:1944年 文中的我们：指英国人 导论 本书的根本出发点是哈耶克所说的，一切源自某些终极价值。本书会毫不含糊的阐明全部论证所依据的那些终极价值是什么。 法西斯主义和纳粹主义的兴起并不是对前一时期社会主义趋势的一种反动，而是那些趋势的必然结果。 迄今对我们所奋斗的明确理想还很少认识。 我们之所以被迷惑，是因为我们据不相信敌人在表白我们所共有的某些信念时是真诚的，也同样因为我们相信他的某些其他主张是真心实意的。 民主社会主义之所以兴起，是由于社会主义观点的流行，而不是由于德国与意大利和俄国所共有的普鲁士主义。同时社会主义是从群众中兴起的，而不是从深受普鲁士传统熏陶并深受其惠的各阶级中兴起的。 第1章 被离弃的道路 我们的社会共识：前一代人中为大多数善良人们所共有的，决定着我们社会生活主要变化的主导观念不会有错。 我们不愿承认的解释：世界的现状或许是我们自身真正错误的后果，对我们所珍爱的某些理想的追求，明显产生了与我们预期大相径庭的结果。 外在的冲突是欧洲思想转变的后果，在这种转变过程中，别的国家进展得很快，以致使他们与我们的理想发生了不可调和的冲突，而我们自身并未置身于这种转变之中。 我们逐渐放弃了经济事务中的自由，而离开这种自由，就绝不会存在以往的那种个人和政治的自由。 这种个人主义的基本特征就是把个人当作人来尊重，就是在他自己的范围内承认他的看法和趣味是至高无上的。 个人活力解放的最大结果，可能就是科学的惊人发展，它随着个人自由从意大利向英国和更远的地方进军。此刻，曾经激励人心的承诺似乎不在够用了，进步的速度太迟缓了；过去曾使这一进展成为可能的那些原则，现在则被视为阻止更快进展得障碍，迫切需要消除掉，而不把它视为保持和发展已经取得的条件了。 也许对自由主义事业危害最大的莫过于某些自由主义者单纯从某种经验主义出发的顽固态度，而尤以自由放任原则为甚。 Karl Mannhein 提出了“为自由而计划”。 1870年开始，自由主义英国的思想开始衰退，德国开始成为思想中心。黑格尔、马克思、李斯特、施莫勒、桑巴特、曼海姆等群星闪耀。 第2章 伟大的乌托邦 总是使一个国家变成人间地狱的人事，恰恰是人们试图将其变成天堂。------ F·荷尔德林 奠定现代社会主义基础的法国作家们毫不怀疑，他们的种种思想只有通过强有力的独裁政府才能付诸实施。 现代计划者第一人圣西门(Saint Siman)，甚至预告对那些不服从他所拟议的计划委员会的人，要“像畜生一样对待”。 民主本质上是一种个人主义的制度，与社会主义有着不可调和的冲突。------ 亚力克西·德·托克维尔 一切政治动因中最强烈的政治动因---渴求自由。 在1848年革命前强大的民主潮流影响下，社会主义才开始于自由力量联系起来，形成了新的“民主社会主义”。 毫无疑问，对更大自由的允诺已经成为社会主义宣传最有效的武器之一，而且，对社会主义将会带来自由的信念是真心实意的。但是，倘若允诺给我们通往自由的道路一旦事实上被证明是一条通往奴役的大路的话，悲剧岂不更惨。 然而，近些年来，一个又一个观察家，对“法西斯主义”和“共产主义”之下许多方面情况的相似性都留下了深刻的印象。列宁的老友马克思·伊斯门(Max Eastman)讲道，“斯大林主义与法西斯主义相比，不是更好，而是更坏，更残酷无情，野蛮，不公正，不道德，反民主，无可救药，最好被称为超法西斯主义”。 早在几年前，在俄国住了12年的美国记者W.H.张伯伦(W.H.Chamberlin)总结道，“社会主义者肯定会证实，至少在其开始时，不是通往自由的道路，而是通往独裁和反独裁，通往最惨烈的内战道路。以民主手段实现并维持的社会主义，看来确实属于乌托邦世界”。 彼得·德鲁克(Peter Drucker)写道，“通过马克思主义可以到达自由与平等的信念完全崩溃，已经迫使俄国走上了德国一直在遵循的相同道路，即通往极权主义的、纯消极的、非经济的、不自由不平等的社会”。这等于说共产主义和法西斯主义本质上是相同的。法西斯主义是在共产主义已被证实为一种幻想之后所打到的一个阶段，而在斯大林主义的俄国和希特勒之前的德国，共产主义已经同样被证实是一种幻想。 民主社会主义，最近几代人的伟大乌托邦，不仅不能实现，而且为之奋斗还会产生某种完全不同的东西，以致现在对之抱有希望的那些人中几乎没有人会准备接受这种结果。除非对社会主义和自由的关联全方位的展开分析，否则是没有人会相信它的。 第3章 个人主义和集体主义 社会主义信仰两种截然不同甚至也许是相互矛盾的东西：自由和组织。------埃利·阿列维(Elie Halevy) 有关社会主义的争论在很大程度上正成为有关手段而不是有关目标的争论。 社会主义是集体主义的一种，本书中将要提到的一切后果，都源于集体主义的方法，而与这些方法所选用的目标没有关系。 “计划”受欢迎的原因很大程度应归于这个事实，即每个人当然希望我们应当尽可能合理地处理问题，同时应尽量运用我们所能获得的预见。 我们的计划者所要求的的是根据一个单一的计划对一切经济活动加以几种管理，规定社会资源应该“有意识的加以管理”，以便按照一种明确的方式为个别的目标服务。 强制力量的控制者的两种选择：1.将自己限制与笼统地创造条件，以便最充分地发挥每个人的知识和创造力，使他们能成功地做出计划。2.为了合理地利用资源，我们是否必须根据某些有意识构造的\"蓝图\"对我们的一切活动加以集中的管理和组织。 采用第2种方法意味着，它是处理我们事务的唯一合理方法，但却未证实这一点。这仍然是计划者和自由主义者的分歧所在。 自由主义的论点，是赞成尽可能地运用竞争力量作为协调人类各种努力的工具，而不是主张让事态放任自流。 使竞争制度有效运行的种种形态的法律制度的系统研究，已经令人痛心的遭到忽视。(尤其是公司法和专利法方面，不仅使竞争远较可能运行的要糟糕，而且甚至已经到了在许多领域摧毁竞争的地步) 竞争和私有财产制度所依赖的主要条件：所有者从其财产所提供的一切有益的服务得到好处，而负担使用其财产对他人造成的损害。 在不可能创造有力竞争适当运行的条件的地方，我们不能不采用当局直接管理的方法取而代之，这一事实并不能证明在可以使竞争发挥作用的地方，我们应压制竞争。 实际上使左、右翼社会主义联合起来的东西，就是对竞争的共同歧视。 计划与竞争只有在为竞争而计划，而不是运用计划反对竞争的时候才能够结合起来。 本书中一切批评所针对的“计划”只是指反对竞争的计划(或者说是用以代替竞争的计划)。","permalink":"https://lihanx.com/blog/60051.html","photos":[]},{"tags":[],"title":"中国古代历法浅析","date":"2020/11/25","text":"中国几部重要的历法 黄帝历是一种阴阳历，以建子之日为一年的开始，开观象授时之起点，创十天干与十二地支，以闰月定四时。 夏历，以月球绕地球一周为一月，即以朔望月作为确定历月的基础，一个月叫做朔望月，每月初一为朔日，每月十五为望日。 以十二地支标定一年中的十二个月，冬至月为子，夏历正月建寅，商历正月建丑，周历正月建子。自汉以后，中国历法皆正月建寅。 [西汉]太初历，邓平、落下闳等人所著，是中国第一部有完整文字记载的历法，规定一年为365.2502日，一月等于29.53086日，将二十四节气纳入历法。 [南朝]大明历，祖冲之所著，成历于南朝宋大明六年(公元462年)，帝不许，祖死后十年，即南朝梁天监九年(公元510年)得以施行。大明历区分回归年和恒星年，首次将岁差引入历法，定回归年为365.24281481日，朔望月长度为29.5309日。 [唐]戊寅元历，傅仁均、崔善为等著，废除以前历法所采用的平朔，改用定朔来安排历谱。这是历史上第一部采用定朔方法且颁行全国的历法。此历亦不在采用没有实际意义的上元积年。 [南宋]统天历，杨忠辅所著，此历亦不采用上元积年的方法，以365.2425日为一年，以29.53059日为一月，这个回归年长度与现行公历完全一样。 [元]授时历，许衡、王恂、郭守敬等著，以365.2425日为一年，以29.530593日为一月，以无中气之月为闰月。正式废除古代的上元积年，而截取近世任意一年为历元，郭守敬等人以至元十七年(公元1280年)冬至时刻作为推算起点。 [清]时宪历，徐光启、汤若望等著，废除了圭表测影法把全年全年分为二十四份据以确定节气的平气，正式采用以太阳在黄道上的位置为标准的定气。近代所用的旧历就是时宪历，通常叫做夏历或农历。 干支纪年 & 干支纪日 天干：甲 、乙 、丙、丁、戊、己、庚、辛、壬、癸 地支：子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥 天干地支分为阳干阳支和阴干阴支。用作纪年或纪日时，阳干对阳支、阴干对阴支，60一个循环。 干支纪年 干支纪年萌芽于西汉初，始行于王莽，通行于东汉。东汉章帝元和二年(公元85年)朝廷下令通行干支纪年，以后从未乱过。 对于阅读史书来说，常用的还是年号纪年，干支纪年应用有限。 干支纪日 干支纪日从商朝就已经开始，据考证，从春秋鲁隐公三年（公元前720年）二月己巳日起到如今，2700多年中从未间断和错乱过。 因为中国古代的历法并不统一，各朝各代使用过的历法多达几十部，所以干支纪日与当时农历之间的换算比较复杂，这里主要介绍干支纪日与公历之间的换算，我们参考的基准点是：北京时间，1984-1-31，甲子日 公历每年365天；每4年是一个闰年，闰年2月份加1天。此外还要遵守两个规则： 每100年，不闰年； 每400年，闰年，规则(1)失效。 例子：我们以崇祯皇帝死亡日期作为例子。据明史记载，崇祯皇帝于公元1644年，农历三月丁未日，崩于万岁山。 故公元1644年1月日为甲子日，即公元1644-2-25为丁未日，公元1644-4-25为丁未日。又因为农历自西汉太初历以后正月建寅，冬至日在11月，公历冬至日12月22日左右，所以公历比农历大约提前了1个月。所以公元1644年，农历三月丁未日为公历1644年4月25日。由此我们可知，崇祯皇帝死于公元1644年4月25日。","permalink":"https://lihanx.com/blog/50099.html","photos":[]},{"tags":[],"title":"putting_auction_to_work-3","date":"2020/11/14","text":"第3章 包络定理和收益等价 机制设计应用于经济学的主要奠基者是Myerson(1981)，Holmstrom(1979)。 Myerson提出一个问题：如果一个出售者能够从所有可能的参数机制中选择一个来出售一个单个不可分的物品来最大化的期望收入，他应该选择哪一个？这个问题又叫作最优拍卖问题。Myerson 导出一个引理，引理是一个确定的且具有所有可行参数机制的收益公式，建立在贝叶斯-纳什均衡之上并且界定了与任何机制有联系的期望收入。 Holmstrom提出一个问题：是否在VCG机制之外存在一些机制能够在显性策略之下实施有效率的决策。他也导出一个引理，引理是一个确定的且具有所有可行参数机制的收益公式，建立在一个显性策略解之上。 这两个收益公式，我们也称为Myerson引理和Holmstrom引理，且它们非常类似于需求理论中的Holtelling引理和Shepard引理。所有的这四个引理都源于包络定理。Myerson处理最优拍卖问题中使用到一个single crossing condition，这个问题本章不涉及，下一章会处理。 目录: 3.1 Hotelling 引理 3.2 包络定理的积分形式 3.3 拟线性收益 3.3.1 Holmstrom引理 3.3.2 Green-Laffont-Holmstrom定理 3.3.3 Meyerson引理 3.3.4 收入等价定理 3.3.5 Meyerson-Satterthwait定理 3.3.6 Jeiel-Moldovanu不可能定理 3.3.7 Merson & Riley-Simuelson收入最大化拍卖 3.3.8 McAfee-McMillam Weak-Cartels定理 3.3.9 顺序拍卖和Weber的鞅定理 3.3.10 Matthew定理：风险厌恶收益等价 3.4 结论 3.1 Hotelling引理 为了强调激励理论与需求理论的紧密联系，我们的分析从回顾Hotelling引理开始。该法则描述受价公司为实现其最大利润所作出的供应行为。 让表示公司可能选择的集合，让表示公司的最大利润，其中为市场价格向量。如果关于是可微的，那么公司产品的净供应额满足。我们有 Hotelling引理： 如果是绝对连续的，那么。如果在上是可微的，那么对于每一个产品，有。 3.2 包络定理的积分形式 在研究生经济课程课本中，包络定理通常用微分形式表示，并且经常依赖于凸假设或选择集的拓扑结构假设。这些假设对于机制设计理论并不圆满，因为参与者的选择问题可能不具有必要结构。举个例子，参与者可能必须从一个缺乏“好的”结构的信息集合中选择一个信息发送给机制操控者。而且，即使的结构不是一个问题，最大价值函数也可能并不是处处可微的。对于一般应用，我们需要的定理是在选择集上没有限制性假设的情况下验证像一样的公式。 我们通过研究最大值问题族及其相关函数得到了这样一个公式。相关函数如下所示，其中参数 对于所有的有 函数是一个价值函数，有时也被称为包络函数，这是因为它的图形表示。对于每一个，如果一个绘制函数，那么是这些函数的上包络。 函数是问题的最优解集，对于某些参数值，这个集合可能是空的。任何来自于且满足的函数是一个selection。包络定理建立价值函数和来自于的任意selection 的关系。这里的包络定理积分形式来自于Milgrom and Segal(2002)。 定理 3.1 (包络定理积分形式) 假设具有下面的性质， 存在一个实值函数使得对于所有并且，有 存在一个可积函数使得对于所有和几乎所有的，有 进一步假设对于几乎所有，有，那么对于任意来自于的selection ，有 可积函数： 3.3 拟线性收益 这一节中，我们聚焦于于参与者的拟线性偏好。本节中我们约定outcome为，其中是来自有限集的一个决策,是参与者向机制操控者进行现金支付的向量，并且任意一个参与者的收益为 为了方便我们有时会把结果函数替换为。分配函数，支付函数。如果我们假设参与者通过一些总是最优策略实施结果，那么，当其他参与者使用对应的于他们真实type的均衡策略时，这个策略是最优的。假设拥有包络定理所要求的可积边界，那么，当agent 具有type ，它的最大值为 我们有时用0-1向量形式来描述结果，取0-1向量，其中。机制的决策性能函数是关于types的函数，其中。我们用向量表示标量值函数，其中第项为。就像有时我们将写作，我们也可以将写作。 3.3.1 Holmstrom引理 Holmstrom引理将values和payments与一些显性策略机制联系在一起。 Holmstrom 引理 假设是连续可微的，令为参与者的full information maximum value，正如所定义的那样，那么 特别的，如果在上可微，那么。参与者的payments必须满足 3.3.2 Green-Laffont-Holmstrom定理 在显性策略机制研究中，一个中心问题就是如何表征机制的完全集，(1)满足相关激励约束(2)实施有效率的决策性能。VCG机制满足上述性质，其他的机制呢？ GLH定理表明，提供的偏好集合满足一个确定的连通性时，VCG机制是仅有的能够实施有效率结果的dominant-strategy incentive-compatible mechanisms。包括Holmstrom引理，这个连通性假设表明价值函数是可微的。 定理 3.2 (GLH定理) 假设每一个有，是smoothly path connected并且是连续可微的，那么任何direct机制满足下面两个条件就是一个VCG机制: (1) 决策结果是有效率的规则; (2) 如实报告是一个总是最优回复，也就是说， 换句话说，给定pivot mechanism payments ，存在函数使得对于所有的，有。特别的，Vickrey拍卖（pivot机制）是仅有的机制使得没有获取物品的失败竞标者的支付为零。 3.3.3 Myerson引理 在实际中，关于如何改变规则来影响价格和收益，许多拍卖设计者、监管者、观察者都抱有错误的高期待。许多人相信拍卖程序能够影响期望售价和竞标者收益，同时不影响物品的分配方式。 根据当前的经济学理论，一个拍卖设计者去操控售价和收益同时不改变分配的能力是非常受限的。这里我们审核当竞标者们在给定他们关于其他人types和strategies下，play Bayes-Nash equilibrium strategies，设计者能做什么使得竞标最优。 定义： 环境中机制的一个strategy profile 是Bayes-Nash均衡，如果对于所有的,有 即， 本章大多数情况下，我们研究的是一个standard independent private values模型。这需如下假设 types是 收益是拟线性的，并且竞标者是风险中性的 values are private types是统计独立的 满足包络定理积分形式条件 在这些假设之下，期望收益可以写作： 让表示在game中type为的player i的最大期望收益，那么 非常类似于Holmstrom引理，我们有定理3.3 定理 3.3 (Myerson引理，收益等价定理) 考虑一个标准独立私人价值模型，并且是game的一个Bayes-Nash均衡，对应的game具有full performance ，那么期望收益满足 特别的，如果在上是可微的，那么，期望支付一定满足 3.3.4 收入等价定理 （风险中性）收益等价定理不仅应用于竞标者收益，也直接作用于出售者的期望收入。此类最初的定理为应用于单个物品拍卖的Myerson收入等价定理。 原书中有payoff和revenue两个单词。其中payoff多指竞标参与者，翻译为收益；revenue多指出售者，翻译为收入。进一步payoff equivalence theorem译为收益等价定理，revenue equivalence theorem译为收入等价定理。 正如前文所述，表示VCG pivot机制： 定理 3.4 (收入等价定理) 考虑一个标准独立私人价值模型，并且假设是game的一个Bayes-Nash均衡，对应的game具有full performance 。那么对于机制操控者来讲，期望支付与VCG机制相同，即。 拍卖理论中著名的收入等价定理是一个特殊情况。收入等价定理还有一个更为著名的版本，如下所示： 推论. 考虑一个关于单个不可分物品售卖的标准独立私人价值模型，且其中失败者的收益为零。假设是game的一个Bayes-Nash均衡，对应的game具有full performance 。令表示竞标者按照从高到底顺序对单个物品的估价，那么机制参与者的全部期望支付为。 标准收入等价定理有很多扩展，下面的一个版本应用于相互依存价值模型，其中提供的types是统计独立的。Milgrom and Weber(1982) 定理 3.5 考虑一个关于单个不可分物品售卖的标准独立私人价值模型，且其中失败者的收益为零。此外，用新条件取代私人价值条件，新条件中每一个竞标者对于物品的估值满足，其中是连续可微的。假设是game的一个Bayes-Nash均衡。如果具有最高type的竞标者总是赢得拍卖，那么每个竞标者的期望收益为并且出售者的期望收入为 收入等价定理的一个重要作用就是作为一个基准来分析没有假设下的案例。下一章会对相关方面进行阐述。 3.3.5 Myerson-Satterthwaite定理 机制设计里早期的另一个著名问题是当买家和卖家都有不确定类型时，在买家与卖家之间设计有效率的交换。这种情况也称为双边垄断或双边贸易问题。在早期的交易成本经济学和交易理论的发展中作为一条公理，表明如果对效率是必要的，无论何时交换都会发生。这个效率公理在纳什交易解、Kalai-Smorodinsky解、shaply值、甚至是科斯定理的推导中是清晰的。 对效率公理的质疑部分是基于不完全信息交易。毕竟卖家倾向于夸大物品的成本，买家倾向于假装他的估值很低。难道我们希望这些夸大其词致使错失交易机会？夸大其词在交易中是一个基本问题吗？可以设计一个交易机制或协议来消除夸大其词的动机吗？如果可以，它将如何工作？ 为了评估答案，我们使用一个简单的单个不可分物品出售模型。有一个潜在的买家和一个潜在的卖家对应的估值分别为和。在拟线性偏好中，当，他们都可以从交易中获益。令和表示买家和卖家在机制均衡时的payments，其中type profile为。我们假设和是光滑有界的，以致可以应用包络定理。 pivot机制(VCG机制中的)似乎是解决问题的可信候选项。它表明当报告的估值满足时，交易应该发生，转移应该进行。When trade takes place,the seller receives a payment of while the buyer pays . 用这种方式决定payment，买家和卖家都会发现如实报告他们的估值总是最优的，不管其他人如何报告。这里有一个预算赤字，因为无论交易什么时候发生我都有。在第2章时，我们观察到，通常，没有VCG机制总是能够准确平衡预算。这是一个严重的问题吗？存在一些机制在一个Bayes-Nash均衡处能够既实施有效率结果又能实现预算平衡吗？ Myerson-Satterthwaite定理表明，在某些条件之下，没有机制能够使得决策性能函数总是最大化全部价值。这个理论采用Bayes-Nash均衡的solution concept. 定理 3.6 (Myerson-Satterthwaite定理) 在定理3.3假设之外，假设参与者和设计者有相同的prior belief:.进一步假设，types是统计独立的，并且和是连续可微的。考虑任意交易机制和Bayes-Nash均衡，(1)恰好时，交易发生在均衡处，(2)type 1的卖家与type 0的买家不能交易，(3)没有交易发生就没有payments。那么机制在交易中的期望支付赤字等于期望收益。整个期望支付满足 3.3.6 Jehiel-Moldovanu 不可能定理 J&M(2001)应用收益等价论证当参与者不具有private values时，机制去实施有效率分配时的限制。没有private values假设，一个竞标者可能知道一些东西，这些东西如果泄露，会影响其他竞标者的选择。 一个用来阐述genaral possibilities的例子是逆向选择中的经典二手车模型，二手车主拥有关于车况的private information. 卖家的信息某种程度上能够影响买家是否在某个价位购买的决策。部分由于这个原因，卖家试图令买家信服他出售这辆车的动机不是因为车况不好。举个例子，卖家的广告可能包含这样一段\"Moving,must sell\"/\"手慢无\"。 举一个拍卖相关的例子，假设城市外部有一块地要出售。参与者1是一个开发商，计划在这里建一个购物中心来吸引郊区的顾客。参与者2是一个矿业公司，对地表下可能的矿床感兴趣。这块地作为购物中心的价值也取决于是否会被吵闹肮脏的采矿作业使用（有时候矿业公司比开发商了解更多）。给定这块地之于开发商的价值取决于矿业公司持有的信息，存在能够有效率分配这块土地的机制吗？ 我们从出售单个项目的interdependent values model开始，为了允许每一个竞标者都拥有其他竞标者信息的可能性，我们通过一个N-vector 来表示每一个竞标者type，其中表示竞标者拥有的关于竞标者对于项目估值的信息。we take the components of the type profile to be jointly distributed according to a atomless distribution on . 竞标者的类型，假设是统计独立的。为了使分析更加简单，我们指定对于竞标者的项目full information value为. 首要的问题是确定是否有一些聪明的支付方案使得结果在事后均衡中具有有效率的分配性能。这意味着每一个player 的策略仅应取决于他自己的type ，但是对于type profile 的每一个实现，strategy profile 应该是一个纳什均衡。solution concept的优势将在第5章讨论。 因此假设有一些分配性能在事后均衡中实施，其中是项目分配给竞标者的可能性，是对应的payment。那么给定，每一个竞标者将会给所有其他竞标者策略以最好的回应。将包络定理的积分形式应用于一维参数，竞标者的均衡收益会被实现，当类型向量满足 即， 定理 3.7 在出售单个物品的相互依存价值模型，假设 depends non-trivially on .那么没有机制在一个事后均衡处实施分配性能. 定理 3.8 令为一个分配性能函数，并且假设函数 depends non-trivially on 。那么没有机制可以在一些Bayes-Nash均衡处实施. 3.3.7 Myerson & Riley-Samuelson 收入最大化拍卖 在本节中，我们回到Myerson(1981)提出的最优拍卖问题。一个相似的拍卖收入最大化理论同期被Riley和Samueson(1981)独立发展，但是这个理论局限于竞标者具有symmetrically distributed values(估值对称分布)。Myerson最初的证明依赖于relevation principle(显示原理)局限于direct incentive-compatiable mechanisms，但是这里我们用包络定理的积分形式来简化他的分析。 考虑单个物品拍卖，其中每个独立个体个体的估值是，每一个是一个严格递增连续可微函数，并且types是独立的uniformly distributed(均匀分布)。注意这些假设并非暗示估值是identically distributed(同分布)：被函数给定的估值分布是严格递增、光滑、有界的分布。 定义 1. 一个参数机制是voluntary，如果对于每一个player 和type ，最大期望效用满足 （其中非参与者的效用归一化为零）。 2. 参数机制中的期望收入为 3. 参数机制是期望收入最大化的，如果对于任何其他的voluntary参数机制有 对于下一个定理，我们将单个获得项目的写作，其它为是便利的。 定理 3.9 考虑一个出售单个物品的标准独立私人价值模型。对于每一个，定义（边际收入作为一个价格函数），并且假设是一个递增函数。进一步假设. 那么一个参数机制是一个收入最大化机制，如果他满足并且有如下的决策性能函数： 再则，至少存在这么一个机制。 3.3.8 McAfee-McMillan Weak-Cartels定理 McAfee和McMillan(1992)是第一批去研究bidding rings理论的，这个理论研究一组竞标者达成关于如何划分拍卖中拍卖品的串通协议。Ring成员们可能会试图在拍卖之前达成他们中谁是赢家，其他竞标者可能会放弃竞标或者低价竞标。在这种情况下，赢家可能会以很低的价格得到拍卖品，从另一个方面来看，这提高了他们的利润。 Rings面临一些列问题，即使他们可以有效率的操作。第1个问题是强制协议，在拍卖中威胁报复那些违背ring规则的人。第2个问题是当拍卖价格还很低时，阻止新的竞标者进入。第3个问题是如何划分红利，这是一个非常严重的问题，正如McAfee与McMillan所讲的那样，大多数美国法务部门的竞标垄断(bid-rigging)定罪始于一个卡特尔成员因为不满自己所分得利润而转向另一个卡特尔组织。为了避免留下会被证明有罪的记录，卡特尔经常避免成员之间的现金支付，这些约束限制了卡特尔成员的成就。 我们把不能在成员之间使用现金支付的ring称为weak ring。有人可能认为，ring成员能够举行讨论并且缝合他们的交易来获取信息优势，绝对会经常按对他们最高价值情况下分配物品。这个问题的复杂之处在于没有side payments来分配利润，竞标者们仅有少量的动机去暴露他们的信息，即使对于ring成员。McAfee和McMillan表明，在一个确定的条件之下，一个弱卡特尔不能从它的成员中获取任何有用的信息，它不能比在成员间进行随机分配更好。 在我们的McAfee-McMillan模型处理中，我们假设卖家设置一个底价(reserve price) ,当且仅当竞标者的估值在或以上时才表示兴趣。Types满足在区间上的独立均匀分布，并且的估值由给出，其中.给定ring设计的参数机制，令表示具有类型的竞标者获取拍卖品的概率，并且令。一致随机分配(corresponding random allocation)是指在忽略类型向量的情况下将拍卖品以概率分配给竞标者。这种随机分配是确定可行的，对于初始机制(original mechanism)是一样的。因为一个type zero参与者没有可能获取一个正利润. 正如Vickrey首先观察到的，必须是不递减的，如果不是，那么一个竞标者会‘修改’竞标者和类型之间的关系，以使他的期望支付不变而增加. 定理 3.10 考虑一个对于单个物品的标准独立私人价值模型，并且假设是一个递减函数。那么weak ring在成员之间分配资产的任何机制对于所有的竞标者来说是事先通过非常不同于随机分配的一致随机分配控制的。 3.3.9 顺序拍卖与weber的鞅定理 在本节中，我们调查当几个同样的拍卖品在同一时间、按顺序出售，且每一个竞标者只能买一件拍卖品时所展现的价格模式。我们发现如果在每一次出售之后宣布价格，那么价格序列会形成一个鞅。这意味着第个拍卖品的期望价格等于第个拍卖品的价格。顺序拍卖的这个性质在下面的应用令人关注，经验表明艺术品和酒类拍卖中的实际价格与这个预测相违背：它们遵循一个递减模式。 为了公式化这个问题，假设存在个相同的拍卖品和个竞标者，并且每一位竞标者被限制只能获取一件拍卖品。这些拍卖品按顺序拍卖的方式拍卖，规则为价高者得且只有赢家付款。我们把拍卖规则写成这样，给定可能在件拍卖品被出售后可能有价值的任何信息，存在一个对称增长的均衡竞标函数，且此函数应用于针对第件拍卖品的竞标。那么在均衡情况之下，最高类型竞标者赢得第一件拍卖品，第二高类型竞标者赢得第二件拍卖品，如此继续。 令表示为第件拍卖品所支付的价格，表示竞标者类型按降序排列的顺序统计，并且表示空信息。 定理 3.11 任意拍卖博弈中的任意均衡满足上面描述的条件，价格序列和信息满足。如果拍卖是first-price auction或second-price auction并且是过去价格序列，那么是一个鞅。 3.3.10 Matthews定理：风险厌恶收益均衡 在上面研究的模型当中，竞标者的收益是预期得到价值(expected vaule received)减去预期支付额(expected amount paid)。这个说明包含两种关于竞标者偏好的假设。第一个是在不确定之下没有选择上的wealth effects:通过向竞标者课税来改变他们的wealth或者在他面临一个风险选择之前给予他一个转移支付不会改变他最偏好的选择。特别的，财富转移不影响竞标者的决策；第二个每一个竞标者对于涉钱投机方面是风险中性的。 Matthews(1983)研究买家具有风险厌恶的那些没有表现出wealth effects偏好的拍卖。正如在风险中立的情况之下，一个简单分析的关键之处在于使用包络定理来获取对竞标者收益的简单限制。在这种情况之下，我们发现在某个确定的层面中，竞标者在拍卖设计中的期望效用不能改变。即竞标者与设计毫不相关。 为了简化分析，我们normalize失败竞标者的效用收益为零，并且令表示竞标者的绝对风险厌恶常数。当获胜时，他的效用收益为，其中，且 定理 3.12 考虑一个拍卖博弈，其中竞标者收益显示常绝对风险厌恶，正如上面特别指出的那样。假设是具有full performance 博弈的一个Bayes-Nash均衡，其中type 0的竞标者总是失败的，并且失败的竞标者的支付总是零。定义。那么，具有type t的竞标者的均衡期望效用为 特别的，具有相同决策性能函数的两个拍卖博弈，指明(specify)相同的期望想用给每一个竞标者的每一个类型。 结论 暂无。","permalink":"https://lihanx.com/blog/34292.html","photos":[]},{"tags":[],"title":"putting_auction_to_work-2","date":"2020/11/09","text":"第一部分 机制设计方法 将机制设计的理论和方法应用于拍卖设计问题。这里有三个基本概念：机制（mechanism）、环境（environment）、性能（performance）。机制设计中有两个主要的问题：信息问题和承诺问题。因为信息问题与拍卖的相关性更高，本书主要聚焦于信息问题。 拍卖模型的3个主要部分：潜在的竞标者、资源信息和分配方式、分配给每一个参与者资源的价值。关于机制设计有3个重要的早期贡献：William Vickrey拍卖设计、Vickrey-Mirrless最优税收设计、Clarke-Groves最优公共物品供给分析。Roger Myerson第一次将机制设计应用到拍卖理论中。 机制设计模型的程序 模型有两个部分：环境和机制。 最简单的情况，环境是一个三元数组(N,Ω,Θ)。N={1,…,n}是一个参与者列表；Ω是可能outcomes集合；Θ=Θ¹×Θ²×…×Θⁿ是type profiles集合。,参与者i的类型索引参与者的信息、信仰和偏好。 type profiles和outcoms可以结合在一起表示个人收益。，因此，表示参与者i在outcome为，type profile为下的收益或效用。 收益还依赖于其他的类型。著名的Nobel经济学奖获得者乔治·阿克洛夫的柠檬市场中提到的逆向选择可以解释这种现象。尽管逆向选择已经存在于拍卖理论中很长时间了，但大部分的拍卖理论还是选择放下逆向选择而聚焦于private-value情况，此时，每一个参与者的效用仅取决于他自己的类型。除非有特殊的说明，本书处理的模型仅限于private-value情况。 大多数的机制模型都假设参与者不确定其他参与者都知道什么。在贝叶斯模型中，条件概率分布描述了一个参与者的beliefs，其仅取决于参与者自己的类型。但是本书中使用Harsanyi doctrine，beliefs源于一个common prior分布，这样做可以排除betting pathologies。 有时候为了方便，我们将type profile写作，表示除了之外其他参与者的类型。机制是一个二元组，是可能的strategy profiles 集合（表示一个player 的可能策略集合），将strategy profiles 映射到outcomes。 我们定义一个对应的策略形式game，来处理机制和类型向量，是一个包含players集合，strategy profiles集合，payoff function的三元组，收益函数将strategy profiles映射到payoff中。 给定一个机制，如果game的理论solution concept 预测一个特殊的strategy profile 将会be played。那么我们就可以使用理论concept的预测来预测和评估机制性能。机制的performance function是。性能函数将type profiles映射到outcomes。 当一个game有多个解时，我们定义参数机制argumented mechanism，为一个推荐解。推荐解表示机制设计者对参与者的一个推荐。如果这个推荐与能够充分捕捉到参与者激励的solution concept保持一致，然后没有参与者会拥有源自推荐的激励，那么是一个关于参与者如何行动的合理预测。 当是根据solution concept得到的解时，我们说或的implements性能为。换句话说，机制的均衡结果为。 第2章 Vickrey-Clarke-Grove 机制 VCG分析已经成为一个重要的标准，在后面的章节中我们会发现VCG理论和拍卖理论的其他部分有很深的联系。 2.1 公式化 表示参与者集合，其中0表示机制操纵者。表示可能的决策集合，元素通常用表示。表示outcome，表示决策，表示参与者支付向量,支付向量中的元素可正可负。 每个参与者根据结果的收益是做决策的价值，用下面公式表示为 我们可知做决策的价值仅仅取决于自己的类型,这种特殊的拟线性效用函数在本章的规范化分析中扮演不可或缺的角色。 Quasilinear Utility: Quasilinear utility functions are linear in one argument,generally the numeraire(计价单位),and strictly concave for the other arguments. 拟线性效用假设暗示竞标者可以进行任意的现金转移。在机制设计中，拟线性效用确保代理人可以通过side payments补偿其他人。 performance表示将environments映射到outcomes。我们之前将outcomes描述为两个部分，我们现在也可以将performance描述为两个部分：decision performance，将types映射到决策；transfer performance，将types映射到payments or transfer。当决策分配物品时，我们也可以将称为allocation performance。 VCG分析有时企图在满足transfer总和为零的约束下实现有效率的performance。给定上文描述的假设，如果decision 能够最大化，那么它是有效率的。 有些时候机制设计者想要在的情况下运行一个拍卖，此时意味着There is never any net transfer to the auciton designer。这些balance-budget机制是非常有用的。 VCG机制是incentive-compatible direct机制，这意味着；strategy profile 是均衡的。第一个条件表示每一个参与者都必须report一个可能的type给机制操控者。第二个条件表示无论我们选择何种solution concept，Truthful report 一个人的type是一个均衡。对于VCG机制我聚焦于dominant-strategy implementation，所以相对的，solution concept就是每个参与者plays a dominant strategy。 incentive-compatible direct机制的一项诉求是避免参与者有进行复杂策略计算的需要。Truthful report符合每一位参与者的利益。例如second-price sealed-bid auction就是一种dominant-strategy incentive-compatible direct机制。 VCG机制操控者使用reported types来计算最大化总和价值和对应的决策 很多人认为使用如此直接的方式会导致失败，因为每一个参与者似乎都有动机去误报偏好来影响决策。事实上，参与者的动机不仅取决于决策，也取决于cash transfer。 为了捕捉参与者的report对于outcome的影响，我们引入一个假设null report，表示参与者report他的决策是中立的，并且只关心transfer。除了以外的部分记为，其中，表示机制设计者，他的收益是机制的纯收益。当参与者做出null report时，VCG机制的最优决策为，对应剩余参与者的全部收益为，又因为机制设计者可以从参与者中获得一个payment ，因此，如果参与者做出null report，在集合中的参与者的全部收益为 假设reported type profile为，的payment为。所以，是的additional payment。决策通常会取决于的report，因此，集合的全部收益为，现在取做出null report，我们有 即， 即， 根据(2.4)，如果参与者的report导致决策发生变化，那么需要额外支付来补偿中成员的损失。 定义 1.一个Vickrey-Clarke-Groves(VCG)机制是一个direct机制，其中满足(2.1),满足(2.4)，payments由决定。 2.如果，那么这个参与者是关键的。 3.当对于所有成立时，VCG机制就成为了pivot 机制（关键机制）。 2.2 总是最优和弱显性策略 在这一节中，我们要验证VCG规则，来确保无论其他参与者的report如何，Truthful report对参与者总是最全有的。我们也会论证truthful report通常是一种显性策略，也是仅有的一种可以总是最优的策略。 显性策略是博弈论中的概念，主要包括两类： 严格显性策略：一个严格显性策略总是为player提供一个更大的效用，无论其他player的策略是什么。 弱显性策略：一个弱显性策略总能为player提供一个至少和其他player同等的效用，并且此策略比总是比其他策略的效用更大。 有些truthful report情况尽管对VCG机制总是最优的，但不是一个显性策略。例如，一件物品成本是200元，第一个人的价值评估为300元，第二个人的价值评估为150元，那么第一个人的report价格在区间，第二个人的report价格在区间，根据VCG机制，第二个人的report对实际结果没有影响。 满足条件(1)，truthful reporting是一个总是最优的策略。 满足条件(1)(2)，truthful reporting是一个显性策略。 (1)对于所有的，有 (2)如果，然后对于一些，有 为了排除一些特定的例子，我们使用下面的条件： All reports are petentially pivotal: 对于所有的并且，存在，使 定理2.1 在任意的VCG机制中，truthful reporting是一个always optimal策略。如果所有的report是potentially pivotal，那么truthful reporting是一个dominant策略。 2.3 平衡预算 在公共物品应用中，设计者可能想要确保除了机制操控者外所有参与者的payment总和为零。这种情况被称为balancing the budget。 这种情况下，机制设计者对于决策没有独立的价值，所以我们的模型变为 定义：一个直接机制满足预算平衡，如果对于所有有限集并且所有的，全部的transfer和为零。 预算平衡的一个必要条件是存在函数，对所有的，有 定理2.2 存在一个VCG机制满足预算平衡当且仅当存在函数使公式(2.5)成立。 2.4 唯一性 VCG以外的机制可以使用dominant strategy做出有效率的决策吗？答案是这取决于关于环境的一些额外的假设。 定理2.3 假设对于每一个，有（或者说是smoothly path connected）并且对于每一个决策结果，有关于第二个参数可微的，那么任何有效率的incentive-compatible direct机制是一个VCG机制。 一个集合是smoothly path connected，如果对于集合中的两个点存在一个可微函数使 2.5 Vickrey拍卖的缺陷 Vickrey拍卖的缺陷主要分为三个部分，practical disadvantages，monotonicity problems，mergerinvestment disadvantages。 2.5.1 实用缺陷 Vickrey拍卖会向竞标者的计算能力课以重税； Vickrey拍卖没有考虑真实的竞标者经常面对严重的预算限制； Vickrey拍卖可能会促使获胜的竞标者透露太多信息。 2.5.2 单调性问题 事实上，决定支付额的竞标者估值函数是非单调的。 在Vickrey拍卖中，(1)增加竞标者可能会降低均衡收益(2)当竞争充足时，收益可能为零(3)甚至失败的竞标者可以拥有有利的联合偏差，因为增加出价来赢得竞标的同时为他们自己创造出更低的价格(4)竞标者可以通过雇佣竞标者增加竞争来降低价格。 2.5.3 并购&投资缺陷 Vickrey拍卖会在拍卖之前扭曲竞标者的投资和并购动机，导致拍卖无效率。","permalink":"https://lihanx.com/blog/17717.html","photos":[]},{"tags":[],"title":"putting_auction_to_work-1","date":"2020/10/28","text":"第一章 Getting to work 书名：putting auction to work 作者：Paul Milgrom Milgrom与他的老师Robert Wilson共同获得2020 Noble prize in economic，奖励他们对新的拍卖制度设计的贡献 这一章是作者关于拍卖设计的经验 1.2 多目标设计 拍卖设计需要基于大量的公开记录。Kwerel提出了一个复杂的拍卖规则，最终形成了一个Milgrom-Wilson-McAfee规则，来进行Simultaneous Multiple Round Ascending auction(SMRAA)同时多轮增价拍卖。 SMRAA在许可证之间互为替代品时是最好的理论设计。（经验表明，频谱许可证之间很接近替代品） 1.2.1 替代品和互补品 拍卖的目的是将货物分配给投标者。在最初的PCS拍卖中，有三个潜在的投标团体。 没有无线业务的长途电话公司，希望获得能够覆盖全美的许可证。（相关公司：MCI,Sprint） 已经存在的无线公司，希望获取更多的许可证扩大它们的覆盖范围。（相关公司：AT&T） 没有无线业务的新参与者，希望获取覆盖大范围地区的许可证，但不用覆盖全美。(相关公司：Pacific Bell in California) 影响效率的几个障碍： 1.证书规格约束 2.涉及大量难以捉摸的复杂细节 3.投标者们的信息不完善 其实，影响效率的最大障碍是Packaging problem。（许可证的价值对于投标者来讲并不是固定的） 例子：考虑两个许可证，当一个投标者拥有一个许可证后，对第二个许可证只愿意付较低的价格，那么这两个许可证互为替代品；当一个投标者拥有一个许可证后，对第二个许可证愿意付较高的价格，那么这两个许可证互为互补品。 1.2.2 新泽西州的频谱权限拍卖 新泽西州采用second-price sealed-bid auction.这种方法适合于单个物品拍卖，当拍卖多个物品，并且这些物品有依赖关系时，这种拍卖方式并不是很有效率。 1.2.3 更好的拍卖设计 模仿Dutch flower auction。 第一轮赢者，可以用他的竞价获得任意多他想要的物品，如果有剩余进入下一轮，无剩余则拍卖结束。 1.2.4 FCC设计及成果 所有许可证一起竞价，促使完全替代品具有相同的价格。 为了防止竞标者陷入局部许可证竞拍，使用activity rule.activity rule主要包括两部分内容eligibility(资格)和activity(活动)。 activity指在任意一轮竞标中，新增投标许可证数量或其实高报价许可证数量。规则指定一个竞标者在一轮的全部activity不能超过它的eligibility。 一个竞标者在第一轮的初始eligibility，通过递交申请和缴纳押金确立；其他轮次取决于最近的竞标activity。（如果竞标者本轮没有activity;那么他就会失去下一轮的资格） SMRAA的变体---clock auction 当前价格在clock上标明，此时每一个竞标者竞标自己需要的数量。刚开始由于价格较低供给量小于需求量；当价格升高，需求量降低，以至于供给量等于需求量时，拍卖结束。 SMRAA的变体---EDF(Electricite de France) auction 不同期限长度的电力电力合同拍卖。规定价格是指每月每百万瓦特的电力价格。 不同时间长度的合同价格不同。例如，3个月合同的价格总是高于6个月合同的电力价格2139欧元，其他长度的电力合同同理。 给定一个较低的起始价格，然后升高价格，耗尽剩余需求，结束拍卖。 1.3 比较销售者利润 对于哪种拍卖方式可以获取更高利润的问题。一个有力的回答是：无论是密封投标还是开放式投标都没有系统性优势。这个回答的理论依据是---payoff equivalence theorem(收益等价理论) 1.4 学术争论 从一个想法到理论再到应用于实践，这个过程会遇到很多问题，很多争论。 1.4.1 转售和科斯定理 很多人认为拍卖根本就不是一个问题，政府拍卖的唯一目的就是赚钱，他们的理论依据是科斯定理。 科斯定理表明，无论分配是多么无效率，一部分人为了利益会继续进行交易，进而消除这种无效率。但是科斯定理的假设是“零交易成本”，实际经验表明在美国的无线许可证交易市场上，由于初次分配造成的无效率并不能被市场交易很快的纠正。 在机制设计中的Myerson-Satterthwaite理论可以解释上述现象。它的结论如下： 交易双方各自拥有关于物品的秘密和可能不同的价值评估，且都想要无风险的强迫另一方接受交易损失，这样的交易是无效率的。 换一句话来说，关于物品价值的私人信息阻碍交易。 1.4.2 机制设计理论 机制就是用一系列规则来管理成员之间的交互。在现实生活中，有用的机制一定要具有稳健性。 尽管机制设计有很多脱离实际的缺点，这本书也会花费大量的篇幅聚焦于机制设计和相关分析。因为这个理论对于在实践中识别问题及影响很有帮助。 1.4.3 理论和实验 与机制设计的纯粹主义者相反，一些经济学家直接用实验来测试拍卖设计。 理论和事实哪个重要？理论源于事实。 1.4.4 实际问题 实际运行中会遇到很多问题，这里选两个例子。 第一个问题关于市场，没有参与者的拍卖是不可能成功的，好的拍卖设计就是要吸引更多更合适的参与者。 第二个问题是担心产权分配。例如，拥挤机场的起飞权和着陆权，中间飞机可能有各种延误或故障，影响机场效率。忽视产权的界定是不可能成功的。 拍卖制度设计要考虑方方面面，运用理论来指导实际拍卖的设计。","permalink":"https://lihanx.com/blog/17525.html","photos":[]},{"tags":[],"title":"论政府","date":"2020/10/27","text":"论政府 政府存在的意义：用权利剥夺权利。","permalink":"https://lihanx.com/blog/51806.html","photos":[]},{"tags":[],"title":"http-live-streaming介绍","date":"2020/10/26","text":"http live streaming 介绍 HLS在互联网上提供一个可靠低成本的连续、长视频传输方式 一、Media Segments 一个media segment被URI和可选字节范围指定；每一个media segment的时长被media playlist的EXINF标签指定。 1.1 Media Segment支持的格式 Media segment在被解析之前，要初始化解析器，这个阶段叫做Media Initialization Section。用EXT-X-MAP标签来指定。 1.2 MPEG-2传输流 MPEG-2传输流segment的Media Initialization Section==Program Association Table(PAT)+Program Map Table(PMT) 1.3 fragmented MPEG-4 fragmented MPEG-4(fMP4)的Media Initialization Section==FileType Box+Movie Box 每一个fMP4 segment在Media playlist中必须有一个EXT-X-MAP标签 1.4 Packed Audio[音频] Packed Audio 没有Media Initialization Section，Packed Audio Segment==encoded audio samples + ID3标签。 1.5 webVTT[字幕] webVTT segments 搬运字幕；webVTT segment的Media Initialization Section是webVTT header 二、Playlist 每一个Playlist文件必须要有一个定义的路径组件，要么是URI，要么是HTTP Content-Type。 2.1 Playlist中的定义 Playlist在UTF-8定义下解码； 每一行要么是URI，要么是空白行，要么以#开头； 以#开头不是注释就是标签； 以#EXT开头的是标签； 一个URI行识别一个Media Segment或Playlist文件。 2.2 属性列表 某些具有‘值’的标签组成属性列表； 属性名有26个大写字母或数字‘0-9’或‘-’组成； （属性名=属性值）中间不能有任何空白。 2.3 Playlist标签 Playlist标签要么是指定全局参数，要么是指定media segment 或 media playlist中的信息。 2.3.1 基础标签 EXTM3U EXT-X-VERSION EXTM3U,表示这是一个Extented M3U Playlist file。 Its format is: #EXTM3U EXT-X-VERSION,除非兼容第一个版本，否则这个标签必须出现，1个Playlist文件有且仅有一个此标签。 Its format is: #EXT-X-VERSION: 2.3.2 Media Segment 标签 每一个Media Segment被一系列Media Segment标签及其后的URI所指定。 Media Segment标签一定不能出现在Master Playlist. A playlist is a media playlist if all URI lines in the playlist identify Media Segments. A playlist is a master playlist if all URI lines in the playlist identify Media Playlists. 一个Playlist 要么是media playlist,要么是 master playlist. EXTINF EXT-X-BYTERANGE EXT-X-DISCONTINUITY EXT-X-KEY EXT-X-MAP EXT-X-PROGRAM-DATE-TIME EXT-X-DATERANGE EXTINF,指定media segment的时长上限（适用于3以上版本）。 Its format is: #EXTINF:,[] 时长,值为十进制浮点数。 EXT-X-BYTERANGE,指定一个media segment是URI识别资源的一个子范围（适用于4以上版本）。 Its format is: #EXT-X-BYTERANGE:[@] 字长，值为十进制整数，表示子范围字节长度。 当media segment包括的URI识别整个资源时，此标签不应该出现。 EXT-X-DISCONTINUITY,表示两个media segment的非连续性。 以下几点发生变化，此标签必须出现： 1.文件格式； 2.数字，类型，indentifiers of tracks. 3.timestamp sequence 以下几点发生变化，此标签应当出现： 1.编码参数 2.编码序列 EXT-X-KEY, media segment可能被加密，此标签表示如何解密。（作用域范围是从此标签开始到下一个EXT-X-KEY标签或文件尾结束） Its format is: #EXT-X-KEY: METHOD,表示加密方式，有NONE，AES-128, SAMPLE-AES URI,值类型为quoted-string,表示如何获取密钥。 IV,值类型为十六进制序列，值为128位无符号整型初始化向量，适用于2以上版本。 KEYFORMAT,指明密钥在被URI所识别资源中如何表示。默认值是“identify”。（可选项，适用于5以上版本） EXT-X-MAP,指明如何获取被请求的media initialization section来解析media segment。（作用域为从此标签到下一个EXT-X-MAP标签或文件尾）（适用于5以上版本） Its format is: #EXT-X-MAP: URI,一个包含URI的quoted-string，此URI识别包含media initialization section的资源（必选项）。 BYTERANGE,值类型为quoted-string,指明被URI属性识别的资源的字节范围。默认字节范围是整个被URI识别的资源。（可选项） EXT-X-PROGRAM-DATE-TIME,将一个绝对日期或时间与一个media segment的first sample关联在一起。 Its format is: #EXT-X-PROGRAM-DATE-TIME: 日期-时间-秒,是ISO/IEC 8601:2004 date/time表示。 例子： #EXT-X-PROGRAM-DATE-TIME:2010-02-19T14:54:23.031+08:00 EXT-X-DATERANGE,将一个时间范围和一系列属性关联在一起。 Its format is: #EXT-X-DATERANGE: ID，值类型为quoted-string，识别一个playlist中的日期范围。（必选项） CLASS，值类型为quoted-string,为客户端自定义。（可选项） START-DATE,值类型为quoted-string,表示时间范围的起始日期。（必选项） END-DATE,值类型为quoted-string,表示时间范围的终止时间。（可选项） DURATION,值类型为十进制浮点数，表示时间范围的长度，以秒为单位。（可选项） PLANNED-DURATION,值类型为十进制浮点数，表示在一个时间范围的时长未知情况下的期望时长。 X-，客户端自定义属性。（可选项） END-ON-NEXT,值类型为enumerated-string且必须为YES，END-ON-NEXT=YES属性必须和class属性同时出现。（可选项） 如果playlist包含一个EXT-X-DATERANGE标签，那么它一定包含至少一个EXT-X-PROGRAM-DATE-TIME标签。 如果语法错误，客户端会忽略此标签。 2.3.3 Media Playlist标签 一个media playlist标签一定不能出现在master playlist中。 EXT-X-TARGETDURATION EXT-X-MEDIA-SEQUENCE EXT-X-DISCONTINUITY-SEQUENCE EXT-X-ENDLIST EXT-X-PLAYLIST-TYPE EXT-X-FRAMES-ONLY EXT-X-TARGETDURATION,表示最大media segment时长。（必选项） Its format is: #EXT-X-TARGETDURATION: 最大时长，值类型为十进制整型，单位为秒。 EXT-X-MEDIA-SEQUENCE,表示出现在playlist文件中第一个media segment的序列号，默认为0。 Its format is: #EXT-X-MEDIA-SEQUENCE: 序列号，值类型为十进制整型。 此标签一定出现在playlist中第一个media segment前面。 EXT-X-DISCONTINUITY-SEQUENCE,默认为0，且必须在EXT-X-DISCONTINUITY标签之前。 EXT-X-ENDLIST,表示不再有media segments加入到media playlist文件中。（应选项） Its format is: #EXT-X-ENDLIST EXT-X-PLAYLIST-TYPE,提供media playlist文件的易变性信息。（可选项） Its format is: #EXT-X-PLAYLIST-TYPE: 类型，值类型为enumerated-string,且值要么是ENENT，要么是VOD。 ENVENT表示media segments只能加入到media playlist的尾部。 VOD表示media playlist不能改变。 EXT-X-I-FRAMES-ONLY,表示在playlist中的每一个media segment描述一个单个的I-frame。I-frame可以用作trick play,such as 快进、rapid reverse、scrubbing。（适用于4以上版本） Its format is: #EXT-X-I-FRAME-ONLY 2.3.4 Master Playlist 标签 master playlist标签不能出现在media playlist中。 EXT-X-MEDIA EXT-X-STREAM-INF EXT-X-I-FRAME-STREAM-INF EXT-x-SESSION-DATA EXT-X-SESSION-KEY EXT-X-MEDIA,被用来关联media playlist Its format is: #EXT-X-MEDIA: TYPE，值类型为enumerated-string,且只能是AUDIO,VIDEO,SUBTITLE,CLOSED_CAPTION。（必选项） URI，值类型为quoted-string,包含一个能识别media playlist文件的URI。（可选项，且TYPE为CLOSED-CAPTION时，URI属性一定不能出现） GROUP-ID，值类型为quoted string，指明rendition所属的group。（必选项） LANGUAGE，值类型为quoted-string,识别rendition使用的语言。（可选项） ASSOC-LANGUAGE，值类型为quoted string，识别与rendition关联的语言（例如，中国话对应简体字和繁体字，简体字对应不同的方言）。（可选项） NAME，值类型为quoted string,包含对rendition的一个可读的描述。（必选项） DEFAULT，值类型为enumerated string，且只能是YES或NO，默认为NO。（可选项） AUTOSELECT，值类型为enumerated-string，且只能是YES或NO，默认为NO。如果DEFAULT=YES，且AUTOSELECT选项出现，则AUTOSELECT=YES。（可选项） FORCED，值类型为enumerated string，且只能是YES或NO，默认为NO。只有TYPE=SUBTITLE时，才能使用此属性。 INSTREAM-ID，值类型为quoted-string,指明media playlist中segments里的一段rendition.(TYPE=CLOSED-CAPTIONS时，为必选项) CHARACTERRISTICS，值类型为quoted-string，包含1个或多个Uniform Type Identifiers[UTI]用逗号分隔。每一个UTI表示一个单独的rendition characteristic。such as,\"public.accessibility.describes-video\"。（可选项） CHANNELS，值类型为quoted string，指明一个有序的，用“/”分隔的参数列表。（应选项） 如果TYPE=AUDIO，第一个参数表示audio通道数，其他参数目前还未定义。 For example, an AC-3 5.1 Rendition would have a CHANNELS=\"6\" attribute。 所有的audio EXT-X-MEDIA标签都应该有CHANNELS属性。如果一个master playlist包含两个rendition编码，且它们具有相同的codec和不同的通道数，那么CHANNELS属性是必须的，其他情况是可选的。 EXT-X-STREAM-INF,指明Variant Stream, Variant Stream是一系列rendition,这些rendition可以结合起来进行演示。这个标签的属性用来提供关于Variant Stream的信息。 在EXT-X-STREAM-INF之后的URI行，指定一个media playlist用来搬运Variant Stream的rendition。（这个URI行是必须的） Its format is: #EXT-X-STREAM-INF: BANDWIDTH，值类型为十进制整型，单位是bits per second,表示Variant Stream的峰值段比特率。（必选项） AVERAGE-BANDWIDTH，值类型为十进制整型，单位是bits per second，表示Variant Stream平均段比特率。（可选项） CODECS，值类型为quoted string，包含一个逗号分隔的格式化列表，每一个格式通过Variant Stream指明一个在1个或多个rendition中出现的media sample type。（应选项） 例子；包含AAC-LC audio和H.264 main profile level 3.0 video的流的CODECS值为“mp4a.40.2,avc1.4d401e”。 RESOLUTION，值类型为decimal-resolution，描述在Variant Stream中展示所有video的最优分辨率。（可选项，但Variant Stream中包含video时，推荐使用） FRAME-RATE，值类型为十进制浮点数，描述在Variant Stream中所有video 的最高帧率。（可选项，但Variant Stream中包含video时，推荐使用） HDCP-LEVEL，值类型为enumerated string，且只能为TYPE-0或NONE。{High-bandwidth Digital content copy protection(HDCP)高带宽数字内容拷贝保护}值为TYPE-0，表示接受HDCP保护；值为NONE，表示不接受HDCP拷贝保护。（可选项） AUDIO，值类型为quoted string，必须和EXT-X-MEDIA标签的GROUP-ID属性匹配，且TYPE属性为AUDIO。此属性指定演示时被使用的一系列audio renditions。（可选项） VIDEO，类上。 SUBTITLE，类上。 CLOSED-CAPTION，情况1，类上；情况2，值为enumerated string，且为NONE。此时所有EXT-X-STREAM-INF标签中的此属性值为NONE。表示Master playlist中的任何一个Variant Stream中都没有closed caption。 EXT-X-I-FRAME-STREAM-INF，展示在一个多媒体演示中，包含I-frames的media playlist文件中的信息。 Its format is: #EXT-X-I-FRAME-STREAM-INF: 在 EXT-X-STREAM-INF标签下的属性，基本上在 EXT-X-I-FRAME-STREAM-INF标签中也有定义，除了FRAME-RATE,AUDIO,SUBTITLES,CLOSED-CAPTIONS。此外，还有一个属性被定义： URI,值类型为quoted string，包含一个识别I-frame media playlist文件的URI。这个playlist文件必须包含EXT-X-I-FRAMES-ONLY标签。 每一个 EXT-X-I-FRAME-STREAM-INF标签必须包含BANDWIDTH属性和URI属性。 EXT-X-SESSION-DATA，此标签允许master playlist中的任意会话数据被搬运。 Its format is: #EXT-X-SESSION-DATA: DATA-ID,值类型为quoted string，用来识别特殊的数据值。（必选项） VALUE，值类型为quoted string，包含被DATA-ID识别的数据。 URI，值类型为quoted string，包含一个URI。 LANGUAGE，值类型为quoted string，包含一个识别VALUE语言的语言标签。 EXT-X-SESSION-KEY，允许来自media playlist的加密密钥在master playlist中被指定。允许客户端在阅读media playlist之前预加载这些密钥。 Its format is: #EXT-X-SESSION-KEY: 在EXT-X-KEY标签下定义的属性也在EXT-X-SESSION-KEY下定义，除了METHOD属性值一定不能是NONE。 如果使用EXT-X-SESSION-KEY标签，那么METHOD,KEYFORMAT,KEYFORMATVERSIONS这些属性的值要与具有相同URI值的EXT-X-KEY标签相匹配。（可选项） 2.3.5 Media or Master Playlist 标签 这些标签在playlist中只能出现一次；在Master Playlist中出现过的，就不应该出现在Media Playlist中。 EXT-X-INDEPENDENT-SEGMENTS EXT-X-START EXT-X-INDEPENDENT-SEGMENTS，表示所有在media segment中的meida samples 可以在不需要其他segments信息的情况下进行解码。 Its format is: #EXT-X-INDEPENDENT-SEGMENTS EXT-X-START，指定playlist中播放的起始点。（可选项） Its format is: #EXT-X-START: TIME-OFFSET，值类型为有符号十进制浮点数，指时间偏移量，单位是秒。（必选项）正值表示从playlist开始处，偏移的正时间量；负值表示从playlist的结尾处偏移的负时间量。 PRECISE，值类型为enumerated-string，且值为YES或NO。if YES，客户端从偏移量确定的起始点开始播放；if NO，客户端从偏移量确定的起始点所在的media segment的开头进行播放。默认为NO。（可选项）","permalink":"https://lihanx.com/blog/49096.html","photos":[]},{"tags":[],"title":"preface-VS-foreword","date":"2020/10/15","text":"preface与foreword的区别 preface: an introduction to a book, especially one that explains the author's aims. foreward: a short introduction at the begining of a book, typically by a person other than the author. portray与describle的区别 portray: 1.depict (someone or something) in a work of art or literature 2.(of an actor) represent or play the part of (someone) in a film or play 3.[with obj, and adverbial] describle (someone or something) in a particular way describle: 1.give an account in words of (someone or something) including all the relevant characteristics, qualities, or events 2.mark out or draw (a geometrical figure) 3.more in a way which follows the outline of (an imaging geometrical figure) 总结：protray偏抽象，describle偏具体。","permalink":"https://lihanx.com/blog/17710.html","photos":[]},{"tags":[],"title":"农村住宅规划图","date":"2020/10/15","text":"农村家庭住宅规划图 以河南省为例，由于国家法律规定，农村宅基地面积由地方根据实际情况进行规划，所以和其他地区会有所不同。讽刺的是，河南省制定的农村宅基地面积标准与实际情况严重不符。河南省农村宅基地合规面积不得超过167平方米，而根据谷歌地图，我们可以清晰的测量出，绝大部分宅基地的面积大约半亩地左右（333平方米），是规定面积的两倍。 对于地方政府这种圈地行为，大概可以用张维迎教授的‘无知’、‘无耻’论来分析。我们以正常人的角度来看，全省的住宅实际使用面积调查可以说是轻而易举，不管是实地测量还是卫星测绘，该有的手段，地方政府都有，显然地方政府不是‘无知’的。地方政府为什么‘无耻’？拆迁补偿。中国正在进行人类历史上最大规模的城市化历程，农村人搬入城市，需要土地来建设住房、小区；原有的城市居民需要更大的住宅来改善自己的居住条件；城市居民开始厌恶33层楼的高密度住宅。这些现实的需求要求地方政府，合并周围地区，扩展城市边界。这一切的一切，最终都落到‘土地’上，地方政府为了获取大量廉价土地，只好对最弱势的农民出手，“有时候，老实人就是被欺负”。地方财政。众所周知，中国大多数地方政府都是实行‘土地财政’的经济政策，这项政策的基本原理很简单‘贱买贵卖’。地方政府没有强大的产业支撑，也就缺少税收基础，按照正常方式发展，地方发展速度不会太高，通过土地政策大量掠夺域内居民财富可以快速的为地方政府积累原始资本，助力该地区快速发展。从农民手里低价掠夺土地，高价卖给城市居民，这就是地方政府的生财之道。掠夺域外资源。地方政府通过土地财政获取原始资本以后，大量引进各种企业、人才，升级本地产业结构，形成正循环以后，对内可以结束‘土地财政’，反哺域内居民，对外通过资本、企业、技术、教育、医疗、安保等进行大规模掠夺。国家限制‘北京’，‘上海’的落户，其实就是限制他们对国内其他地方的掠夺，国家建立‘国家中心城市’，就是通过政策的力量让全国的掠夺中心分布的更加合理，等到这些掠夺中心完成产业升级，就可以结束‘土地财政’政策，实现社会经济的健康发展。{对于农村居民来说，千万不要贪便宜，移居到毫无特色的小城市去，可能会使家族被迫接受二次掠夺} 我的规划 1354021f84900887c.png 0o6DUK.png 0o65Uf.png 0ocFM9.png 0ocVVx.png 0oceIK.png 0ocuGD.png PDF下载链接： https://pan.baidu.com/s/1aRjLEll6tm5BZtCaZzYpfA 提取码：1234","permalink":"https://lihanx.com/blog/40276.html","photos":[]},{"tags":[],"title":"Louise_gluck","date":"2020/10/09","text":"2020诺贝尔文学奖得主——Louise Glück Louise是美籍匈牙利裔犹太人，出生于纽约长岛，从小就深受家庭影响，对文学诗歌有较深的了解。从多个对她的采访中可以看出，她是一个性格温和而又敏感的人。正是这份敏感，不仅给她以对文学、对诗歌、对生活有超出常人的理解，也让Louise在青少年和青年时期深受精神方面的困扰。 对Glück这个名字发音的兴趣 很明显，英语中根本就没有ü这个字母，也没有相对应的发音。在德语、匈牙利语和拉丁语中有这个字母，巧合的是在汉语的发音中也有这个字母。汉语中ü的发音和匈牙利语中ü的发音是一致的/yu/，因此，一些中国人把Glück这个名字翻译为‘格吕克’。 然而，事情并不这样简单。只有26个字母的英语，无法发出/yu/的音，所以他们就找了一个比较相似的音/I/来代替。这对于讲英语的人士是可以接受的，毕竟不同语言音译大致相同就可以了，但是，一些中国人直接通过英语发音译为汉语中的/i/，所以Glück这个名字就被译为‘格丽克’、‘格利克’。 这件事还没有结束。英语中根本没有ü这个字母，所以Louise Glück的英文名字应该是Louise Gluck。然后按照英语发音读出这个名字就像中文的‘格鲁克’，所以Gluck这个名字就被译为了‘格鲁克’。 我在YouTube看了几个关于Louise Glück的采访视频，有的叫她‘格利克’，有的叫她‘格鲁克’。我的观点是：无所谓了，反正我们大多数人都见不到她，想怎么读就怎么读；如果有机会见到她，就问一下，“你的名字怎么读？”。 对Louise Glück 诗歌的理解 显然，我对西方的诗歌并不了解，就是她诗歌里的英文单词我都认不全，更谈不上理解了。培养对于诗歌的感觉，需要花费大量的时间，最好就是在孩童时期。长大了，就有很多身不由己，没时间、没心情去做了（其实就是懒）。不可否认，我要在这里做一个附庸风雅的人。这里摘录她的一首有名的诗《The Wild Iris》 At the end of my suffering there was a door. Hear me out: that which you call death I remember. Overhead, noises, branches of the pine shifting. Then nothing. The weak sun flickered over the dry surface. It is terrible to survive as consciousness buried in the dark earth. Then it was over: that which you fear, being a soul and unable to speak. ending abruptly, the stiff earth bending a little. And what I took to be birds darting in low shrubs. You who do not remember passage from the other world I tell you I could speak again: whatever returns from oblivion returns to find a voice: from the center of my life came a great fountain, deep blue shadows on azure seawater. Louise Glück于2004年出版的诗集 链接：https://pan.baidu.com/s/1bR9V1niAed__e9bEMaUgKg 提取码：1234","permalink":"https://lihanx.com/blog/38433.html","photos":[]},{"tags":[],"title":"python的字符串和编码问题","date":"2020/09/13","text":"python的字符串和编码问题 在计算机内存中，统一使用Unicode编码，当需要保存到硬盘或者需要传输的时候，就转换为UTF-8编码 ord()函数获取字符的整数表示，chr()函数把编码转换为对应的字符 ord('A') chr('48') python的编解码 python在内存中的字符串类型为str,如果需要网络传输或存放在硬盘中需要转变为bytes类型。 str类型可以通过编码的方法转换为bytes类型 '中文'.encode('utf-8') bytes类型可以通过解码的方法转换为str类型 b'\\xe4\\xb8\\xad\\xe6\\x96\\x87'.decode('utf-8') len()函数计算str类型字符串的字符数或bytes类型字符串的字节数。 当源代码包含中文字符或其他非ASCII码字符时，最好在源文件的头部加上 #!/usr/bin/env python3 # -*- coding: utf-8 -*- python的格式化输出 python的格式化输出的方法有三种，我们取最简单的f-string为例 >>> r = 2.5 >>> s = 3.14 * r ** 2 >>> print(f'The area of a circle with radius {r} is {s:.2f}') The area of a circle with radius 2.5 is 19.62","permalink":"https://lihanx.com/blog/63088.html","photos":[]},{"tags":[],"title":"现代西方主流经济学发展史","date":"2020/08/29","text":"现代西方主流经济学发展史 现代西方经济学起源于亚当.斯密时代，以亚当.斯密于公元1776年发表《国富论》为起点，西方经济学已经走过了快250年。以今天的西方经济学知识体系回顾亚当.斯密时代经济学家的著作，会发现当时经济学家包括亚当.斯密的一些经济学思想都是错误的。但是，瑕不掩瑜，正是经过一代代西方经济学家的不断努力，新的理论建立、错误的理论抛弃，才形成了当今的西方经济学。 16世纪-17世纪 重商主义 国家干预对外贸易&国际金融 18世纪下半叶 重农主义 自由放任（代表人物：魁奈、杜尔阁） 1723-1790 亚当·斯密 [开创古典政治经济学派] 1748-1832 边沁 [效益论] 1766-1834 马尔萨斯 [人口论、供求论] 1772-1823 大卫·李嘉图 [比较优势] 1806-1873 约翰·密尔 [古典政治经济学集大成者] 1834-1910 瓦尔拉斯 [开创洛桑学派、边际效用、均衡理论] 1835-1882 杰文斯 [边际效用] 1840-1921 门格尔 [开创奥地利学派、边际效用、主观价值论] 1842-1924 阿尔弗雷德·马歇尔 [开创剑桥学派、新古典政治经济学派] 1848-1923 帕累托 [洛桑学派、帕累托最优、二八法则] 1851-1926 维塞尔 [奥地利学派、机会成本] 1877-1959 庇古 [剑桥学派、外部性原理] 1899-1967 爱德华·张伯伦 [垄断竞争] 1903-1983 琼·罗宾逊 [不完全竞争] 1883-1946 凯恩斯 [开创宏观经济学] 1904-1989 约翰·希克斯 [IS-SM模型、消费者理论] 1915-2009 保罗·萨缪尔森 [开创新古典综合经济学派] 1912-2006 米尔顿·弗里德曼 [开创货币主义学派] 1940-？ 乔治·阿克洛夫 [信息不对称] 1943-？ 迈克尔·斯宾塞 [信息不对称、信号传递模型] 1943-？ 约瑟夫·斯蒂格利茨 [信息不对称] 1945-？ 理查德·塞勒 [行为经济学]","permalink":"https://lihanx.com/blog/3919.html","photos":[]},{"tags":[{"name":"powershell","slug":"powershell","permalink":"https://lihanx.com/tags/powershell/"}],"title":"Excution policy in windows powershell","date":"2020/08/03","text":"windows powershell 的执行策略 powershell 相比于CMD命令行有很大的优势，特别是和linux命令结合方面，powershell 可以和Linux紧密的结合起来。所以现在是全面转向powershell的时候了！ powershell在Windows平台默认是不能执行脚本的，需要自行了解excution policy。下面从excution policy权限种类、权限范围和相关命令来介绍Windows平台下powershell的excution policy。 权限种类 >AllSigned: >1.可以运行脚本 > >2.要求脚本和配置文件由可信任的publisher发布或者脚本由自己在local computer上写成 > >3.非信任来源的脚本运行给出提醒 Bypass: 运行所有脚本，没有提醒 RemoteSigned: 可以运行脚本，但需要网络下载数字签名，其中在local computer上写的脚本不需要数字签名 Restricted: 允许独立的命令，但不允许运行脚本 权限范围 >MachinePolicy: 所有使用此计算机的人（组策略） > >UserPolicy: 当前使用此计算机的人（组策略） > >Process: 当前powershell会话 > >Current User: 当前使用此计算机的人 > >Local Machine: 所有使用此计算机的人[系统默认值] 权限更改命令 获取当前会话的执行权限信息 Get-ExecutionPolicy -List 更改执行权限 Set-ExecutionPolicy -ExecutionPolicy RemoteSigned Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser 移除执行权限 Set-ExecutionPolicy -ExecutionPolicy Undefined -Scope LocalMachine 总结 一般来说，获取默认范围（local machine）的Bypass权限就可以了。 [别忘了获取powershell管理员权限] Set-ExecutionPolicy -ExecutionPolicy Bypass","permalink":"https://lihanx.com/blog/17117.html","photos":[]},{"tags":[],"title":"图床工具选择","date":"2020/07/29","text":"图床工具 因为搭建博客使用markdown工具，插入图片这种刚需就需要借助图床工具来来实现，本人大概了解了网络上的几种常用的图床工具，以下几种速度快，限制小，可以作为常用的图床工具（smms国内现在无法使用）。 imgURL图床 路过图床 smms图床 962图床","permalink":"https://lihanx.com/blog/6883.html","photos":[]}],"categories":[],"tags":[{"name":"powershell","slug":"powershell","permalink":"https://lihanx.com/tags/powershell/"}]}