{"meta":{"title":"lihan's blog","subtitle":"","description":"","author":"lihan","url":"https://lihanx.com","root":"/"},"posts":[{"tags":[],"title":"通往奴役之路摘选_1","date":"2021/01/07","text":"The Road to Serfdom 作者：弗里德里希·奥古斯特·冯·哈耶克 首次出版年份:1944年 文中的我们：指英国人 导论 本书的根本出发点是哈耶克所说的，一切源自某些终极价值。本书会毫不含糊的阐明全部论证所依据的那些终极价值是什么。 法西斯主义和纳粹主义的兴起并不是对前一时期社会主义趋势的一种反动，而是那些趋势的必然结果。 迄今对我们所奋斗的明确理想还很少认识。 我们之所以被迷惑，是因为我们据不相信敌人在表白我们所共有的某些信念时是真诚的，也同样因为我们相信他的某些其他主张是真心实意的。 民主社会主义之所以兴起，是由于社会主义观点的流行，而不是由于德国与意大利和俄国所共有的普鲁士主义。同时社会主义是从群众中兴起的，而不是从深受普鲁士传统熏陶并深受其惠的各阶级中兴起的。 第1章 被离弃的道路 我们的社会共识：前一代人中为大多数善良人们所共有的，决定着我们社会生活主要变化的主导观念不会有错。 我们不愿承认的解释：世界的现状或许是我们自身真正错误的后果，对我们所珍爱的某些理想的追求，明显产生了与我们预期大相径庭的结果。 外在的冲突是欧洲思想转变的后果，在这种转变过程中，别的国家进展得很快，以致使他们与我们的理想发生了不可调和的冲突，而我们自身并未置身于这种转变之中。 我们逐渐放弃了经济事务中的自由，而离开这种自由，就绝不会存在以往的那种个人和政治的自由。 这种个人主义的基本特征就是把个人当作人来尊重，就是在他自己的范围内承认他的看法和趣味是至高无上的。 个人活力解放的最大结果，可能就是科学的惊人发展，它随着个人自由从意大利向英国和更远的地方进军。此刻，曾经激励人心的承诺似乎不在够用了，进步的速度太迟缓了；过去曾使这一进展成为可能的那些原则，现在则被视为阻止更快进展得障碍，迫切需要消除掉，而不把它视为保持和发展已经取得的条件了。 也许对自由主义事业危害最大的莫过于某些自由主义者单纯从某种经验主义出发的顽固态度，而尤以自由放任原则为甚。 Karl Mannhein 提出了“为自由而计划”。 1870年开始，自由主义英国的思想开始衰退，德国开始成为思想中心。黑格尔、马克思、李斯特、施莫勒、桑巴特、曼海姆等群星闪耀。 第2章 伟大的乌托邦 总是使一个国家变成人间地狱的人事，恰恰是人们试图将其变成天堂。------ F·荷尔德林 奠定现代社会主义基础的法国作家们毫不怀疑，他们的种种思想只有通过强有力的独裁政府才能付诸实施。 现代计划者第一人圣西门(Saint Siman)，甚至预告对那些不服从他所拟议的计划委员会的人，要“像畜生一样对待”。 民主本质上是一种个人主义的制度，与社会主义有着不可调和的冲突。------ 亚力克西·德·托克维尔 一切政治动因中最强烈的政治动因---渴求自由。 在1848年革命前强大的民主潮流影响下，社会主义才开始于自由力量联系起来，形成了新的“民主社会主义”。 毫无疑问，对更大自由的允诺已经成为社会主义宣传最有效的武器之一，而且，对社会主义将会带来自由的信念是真心实意的。但是，倘若允诺给我们通往自由的道路一旦事实上被证明是一条通往奴役的大路的话，悲剧岂不更惨。 然而，近些年来，一个又一个观察家，对“法西斯主义”和“共产主义”之下许多方面情况的相似性都留下了深刻的印象。列宁的老友马克思·伊斯门(Max Eastman)讲道，“斯大林主义与法西斯主义相比，不是更好，而是更坏，更残酷无情，野蛮，不公正，不道德，反民主，无可救药，最好被称为超法西斯主义”。 早在几年前，在俄国住了12年的美国记者W.H.张伯伦(W.H.Chamberlin)总结道，“社会主义者肯定会证实，至少在其开始时，不是通往自由的道路，而是通往独裁和反独裁，通往最惨烈的内战道路。以民主手段实现并维持的社会主义，看来确实属于乌托邦世界”。 彼得·德鲁克(Peter Drucker)写道，“通过马克思主义可以到达自由与平等的信念完全崩溃，已经迫使俄国走上了德国一直在遵循的相同道路，即通往极权主义的、纯消极的、非经济的、不自由不平等的社会”。这等于说共产主义和法西斯主义本质上是相同的。法西斯主义是在共产主义已被证实为一种幻想之后所打到的一个阶段，而在斯大林主义的俄国和希特勒之前的德国，共产主义已经同样被证实是一种幻想。 民主社会主义，最近几代人的伟大乌托邦，不仅不能实现，而且为之奋斗还会产生某种完全不同的东西，以致现在对之抱有希望的那些人中几乎没有人会准备接受这种结果。除非对社会主义和自由的关联全方位的展开分析，否则是没有人会相信它的。 第3章 个人主义和集体主义 社会主义信仰两种截然不同甚至也许是相互矛盾的东西：自由和组织。------埃利·阿列维(Elie Halevy) 有关社会主义的争论在很大程度上正成为有关手段而不是有关目标的争论。 社会主义是集体主义的一种，本书中将要提到的一切后果，都源于集体主义的方法，而与这些方法所选用的目标没有关系。 “计划”受欢迎的原因很大程度应归于这个事实，即每个人当然希望我们应当尽可能合理地处理问题，同时应尽量运用我们所能获得的预见。 我们的计划者所要求的的是根据一个单一的计划对一切经济活动加以几种管理，规定社会资源应该“有意识的加以管理”，以便按照一种明确的方式为个别的目标服务。 强制力量的控制者的两种选择：1.将自己限制与笼统地创造条件，以便最充分地发挥每个人的知识和创造力，使他们能成功地做出计划。2.为了合理地利用资源，我们是否必须根据某些有意识构造的\"蓝图\"对我们的一切活动加以集中的管理和组织。 采用第2种方法意味着，它是处理我们事务的唯一合理方法，但却未证实这一点。这仍然是计划者和自由主义者的分歧所在。 自由主义的论点，是赞成尽可能地运用竞争力量作为协调人类各种努力的工具，而不是主张让事态放任自流。 使竞争制度有效运行的种种形态的法律制度的系统研究，已经令人痛心的遭到忽视。(尤其是公司法和专利法方面，不仅使竞争远较可能运行的要糟糕，而且甚至已经到了在许多领域摧毁竞争的地步) 竞争和私有财产制度所依赖的主要条件：所有者从其财产所提供的一切有益的服务得到好处，而负担使用其财产对他人造成的损害。 在不可能创造有力竞争适当运行的条件的地方，我们不能不采用当局直接管理的方法取而代之，这一事实并不能证明在可以使竞争发挥作用的地方，我们应压制竞争。 实际上使左、右翼社会主义联合起来的东西，就是对竞争的共同歧视。 计划与竞争只有在为竞争而计划，而不是运用计划反对竞争的时候才能够结合起来。 本书中一切批评所针对的“计划”只是指反对竞争的计划(或者说是用以代替竞争的计划)。","permalink":"https://lihanx.com/blog/60051.html","photos":[]},{"tags":[],"title":"中国古代历法浅析","date":"2020/11/25","text":"中国几部重要的历法 黄帝历是一种阴阳历，以建子之日为一年的开始，开观象授时之起点，创十天干与十二地支，以闰月定四时。 夏历，以月球绕地球一周为一月，即以朔望月作为确定历月的基础，一个月叫做朔望月，每月初一为朔日，每月十五为望日。 以十二地支标定一年中的十二个月，冬至月为子，夏历正月建寅，商历正月建丑，周历正月建子。自汉以后，中国历法皆正月建寅。 [西汉]太初历，邓平、落下闳等人所著，是中国第一部有完整文字记载的历法，规定一年为365.2502日，一月等于29.53086日，将二十四节气纳入历法。 [南朝]大明历，祖冲之所著，成历于南朝宋大明六年(公元462年)，帝不许，祖死后十年，即南朝梁天监九年(公元510年)得以施行。大明历区分回归年和恒星年，首次将岁差引入历法，定回归年为365.24281481日，朔望月长度为29.5309日。 [唐]戊寅元历，傅仁均、崔善为等著，废除以前历法所采用的平朔，改用定朔来安排历谱。这是历史上第一部采用定朔方法且颁行全国的历法。此历亦不在采用没有实际意义的上元积年。 [南宋]统天历，杨忠辅所著，此历亦不采用上元积年的方法，以365.2425日为一年，以29.53059日为一月，这个回归年长度与现行公历完全一样。 [元]授时历，许衡、王恂、郭守敬等著，以365.2425日为一年，以29.530593日为一月，以无中气之月为闰月。正式废除古代的上元积年，而截取近世任意一年为历元，郭守敬等人以至元十七年(公元1280年)冬至时刻作为推算起点。 [清]时宪历，徐光启、汤若望等著，废除了圭表测影法把全年全年分为二十四份据以确定节气的平气，正式采用以太阳在黄道上的位置为标准的定气。近代所用的旧历就是时宪历，通常叫做夏历或农历。 干支纪年 & 干支纪日 天干：甲 、乙 、丙、丁、戊、己、庚、辛、壬、癸 地支：子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥 天干地支分为阳干阳支和阴干阴支。用作纪年或纪日时，阳干对阳支、阴干对阴支，60一个循环。 干支纪年 干支纪年萌芽于西汉初，始行于王莽，通行于东汉。东汉章帝元和二年(公元85年)朝廷下令通行干支纪年，以后从未乱过。 对于阅读史书来说，常用的还是年号纪年，干支纪年应用有限。 干支纪日 干支纪日从商朝就已经开始，据考证，从春秋鲁隐公三年（公元前720年）二月己巳日起到如今，2700多年中从未间断和错乱过。 因为中国古代的历法并不统一，各朝各代使用过的历法多达几十部，所以干支纪日与当时农历之间的换算比较复杂，这里主要介绍干支纪日与公历之间的换算，我们参考的基准点是：北京时间，1984-1-31，甲子日 公历每年365天；每4年是一个闰年，闰年2月份加1天。此外还要遵守两个规则： 每100年，不闰年； 每400年，闰年，规则(1)失效。 例子：我们以崇祯皇帝死亡日期作为例子。据明史记载，崇祯皇帝于公元1644年，农历三月丁未日，崩于万岁山。 故公元1644年1月日为甲子日，即公元1644-2-25为丁未日，公元1644-4-25为丁未日。又因为农历自西汉太初历以后正月建寅，冬至日在11月，公历冬至日12月22日左右，所以公历比农历大约提前了1个月。所以公元1644年，农历三月丁未日为公历1644年4月25日。由此我们可知，崇祯皇帝死于公元1644年4月25日。","permalink":"https://lihanx.com/blog/50099.html","photos":[]},{"tags":[],"title":"putting_auction_to_work-3","date":"2020/11/14","text":"第3章 包络定理和收益等价 机制设计应用于经济学的主要奠基者是Myerson(1981)，Holmstrom(1979)。 Myerson提出一个问题：如果一个出售者能够从所有可能的参数机制中选择一个来出售一个单个不可分的物品来最大化的期望收入，他应该选择哪一个？这个问题又叫作最优拍卖问题。Myerson 导出一个引理，引理是一个确定的且具有所有可行参数机制的收益公式，建立在贝叶斯-纳什均衡之上并且界定了与任何机制有联系的期望收入。 Holmstrom提出一个问题：是否在VCG机制之外存在一些机制能够在显性策略之下实施有效率的决策。他也导出一个引理，引理是一个确定的且具有所有可行参数机制的收益公式，建立在一个显性策略解之上。 这两个收益公式，我们也称为Myerson引理和Holmstrom引理，且它们非常类似于需求理论中的Holtelling引理和Shepard引理。所有的这四个引理都源于包络定理。Myerson处理最优拍卖问题中使用到一个single crossing condition，这个问题本章不涉及，下一章会处理。 目录: 3.1 Hotelling 引理 3.2 包络定理的积分形式 3.3 拟线性收益 3.3.1 Holmstrom引理 3.3.2 Green-Laffont-Holmstrom定理 3.3.3 Meyerson引理 3.3.4 收入等价定理 3.3.5 Meyerson-Satterthwait定理 3.3.6 Jeiel-Moldovanu不可能定理 3.3.7 Merson & Riley-Simuelson收入最大化拍卖 3.3.8 McAfee-McMillam Weak-Cartels定理 3.3.9 顺序拍卖和Weber的鞅定理 3.3.10 Matthew定理：风险厌恶收益等价 3.4 结论 3.1 Hotelling引理 为了强调激励理论与需求理论的紧密联系，我们的分析从回顾Hotelling引理开始。该法则描述受价公司为实现其最大利润所作出的供应行为。 让表示公司可能选择的集合，让表示公司的最大利润，其中为市场价格向量。如果关于是可微的，那么公司产品的净供应额满足。我们有 Hotelling引理： 如果是绝对连续的，那么。如果在上是可微的，那么对于每一个产品，有。 3.2 包络定理的积分形式 在研究生经济课程课本中，包络定理通常用微分形式表示，并且经常依赖于凸假设或选择集的拓扑结构假设。这些假设对于机制设计理论并不圆满，因为参与者的选择问题可能不具有必要结构。举个例子，参与者可能必须从一个缺乏“好的”结构的信息集合中选择一个信息发送给机制操控者。而且，即使的结构不是一个问题，最大价值函数也可能并不是处处可微的。对于一般应用，我们需要的定理是在选择集上没有限制性假设的情况下验证像一样的公式。 我们通过研究最大值问题族及其相关函数得到了这样一个公式。相关函数如下所示，其中参数 对于所有的有 函数是一个价值函数，有时也被称为包络函数，这是因为它的图形表示。对于每一个，如果一个绘制函数，那么是这些函数的上包络。 函数是问题的最优解集，对于某些参数值，这个集合可能是空的。任何来自于且满足的函数是一个selection。包络定理建立价值函数和来自于的任意selection 的关系。这里的包络定理积分形式来自于Milgrom and Segal(2002)。 定理 3.1 (包络定理积分形式) 假设具有下面的性质， 存在一个实值函数使得对于所有并且，有 存在一个可积函数使得对于所有和几乎所有的，有 进一步假设对于几乎所有，有，那么对于任意来自于的selection ，有 可积函数： 3.3 拟线性收益 这一节中，我们聚焦于于参与者的拟线性偏好。本节中我们约定outcome为，其中是来自有限集的一个决策,是参与者向机制操控者进行现金支付的向量，并且任意一个参与者的收益为 为了方便我们有时会把结果函数替换为。分配函数，支付函数。如果我们假设参与者通过一些总是最优策略实施结果，那么，当其他参与者使用对应的于他们真实type的均衡策略时，这个策略是最优的。假设拥有包络定理所要求的可积边界，那么，当agent 具有type ，它的最大值为 我们有时用0-1向量形式来描述结果，取0-1向量，其中。机制的决策性能函数是关于types的函数，其中。我们用向量表示标量值函数，其中第项为。就像有时我们将写作，我们也可以将写作。 3.3.1 Holmstrom引理 Holmstrom引理将values和payments与一些显性策略机制联系在一起。 Holmstrom 引理 假设是连续可微的，令为参与者的full information maximum value，正如所定义的那样，那么 特别的，如果在上可微，那么。参与者的payments必须满足 3.3.2 Green-Laffont-Holmstrom定理 在显性策略机制研究中，一个中心问题就是如何表征机制的完全集，(1)满足相关激励约束(2)实施有效率的决策性能。VCG机制满足上述性质，其他的机制呢？ GLH定理表明，提供的偏好集合满足一个确定的连通性时，VCG机制是仅有的能够实施有效率结果的dominant-strategy incentive-compatible mechanisms。包括Holmstrom引理，这个连通性假设表明价值函数是可微的。 定理 3.2 (GLH定理) 假设每一个有，是smoothly path connected并且是连续可微的，那么任何direct机制满足下面两个条件就是一个VCG机制: (1) 决策结果是有效率的规则; (2) 如实报告是一个总是最优回复，也就是说， 换句话说，给定pivot mechanism payments ，存在函数使得对于所有的，有。特别的，Vickrey拍卖（pivot机制）是仅有的机制使得没有获取物品的失败竞标者的支付为零。 3.3.3 Myerson引理 在实际中，关于如何改变规则来影响价格和收益，许多拍卖设计者、监管者、观察者都抱有错误的高期待。许多人相信拍卖程序能够影响期望售价和竞标者收益，同时不影响物品的分配方式。 根据当前的经济学理论，一个拍卖设计者去操控售价和收益同时不改变分配的能力是非常受限的。这里我们审核当竞标者们在给定他们关于其他人types和strategies下，play Bayes-Nash equilibrium strategies，设计者能做什么使得竞标最优。 定义： 环境中机制的一个strategy profile 是Bayes-Nash均衡，如果对于所有的,有 即， 本章大多数情况下，我们研究的是一个standard independent private values模型。这需如下假设 types是 收益是拟线性的，并且竞标者是风险中性的 values are private types是统计独立的 满足包络定理积分形式条件 在这些假设之下，期望收益可以写作： 让表示在game中type为的player i的最大期望收益，那么 非常类似于Holmstrom引理，我们有定理3.3 定理 3.3 (Myerson引理，收益等价定理) 考虑一个标准独立私人价值模型，并且是game的一个Bayes-Nash均衡，对应的game具有full performance ，那么期望收益满足 特别的，如果在上是可微的，那么，期望支付一定满足 3.3.4 收入等价定理 （风险中性）收益等价定理不仅应用于竞标者收益，也直接作用于出售者的期望收入。此类最初的定理为应用于单个物品拍卖的Myerson收入等价定理。 原书中有payoff和revenue两个单词。其中payoff多指竞标参与者，翻译为收益；revenue多指出售者，翻译为收入。进一步payoff equivalence theorem译为收益等价定理，revenue equivalence theorem译为收入等价定理。 正如前文所述，表示VCG pivot机制： 定理 3.4 (收入等价定理) 考虑一个标准独立私人价值模型，并且假设是game的一个Bayes-Nash均衡，对应的game具有full performance 。那么对于机制操控者来讲，期望支付与VCG机制相同，即。 拍卖理论中著名的收入等价定理是一个特殊情况。收入等价定理还有一个更为著名的版本，如下所示： 推论. 考虑一个关于单个不可分物品售卖的标准独立私人价值模型，且其中失败者的收益为零。假设是game的一个Bayes-Nash均衡，对应的game具有full performance 。令表示竞标者按照从高到底顺序对单个物品的估价，那么机制参与者的全部期望支付为。 标准收入等价定理有很多扩展，下面的一个版本应用于相互依存价值模型，其中提供的types是统计独立的。Milgrom and Weber(1982) 定理 3.5 考虑一个关于单个不可分物品售卖的标准独立私人价值模型，且其中失败者的收益为零。此外，用新条件取代私人价值条件，新条件中每一个竞标者对于物品的估值满足，其中是连续可微的。假设是game的一个Bayes-Nash均衡。如果具有最高type的竞标者总是赢得拍卖，那么每个竞标者的期望收益为并且出售者的期望收入为 收入等价定理的一个重要作用就是作为一个基准来分析没有假设下的案例。下一章会对相关方面进行阐述。 3.3.5 Myerson-Satterthwaite定理 机制设计里早期的另一个著名问题是当买家和卖家都有不确定类型时，在买家与卖家之间设计有效率的交换。这种情况也称为双边垄断或双边贸易问题。在早期的交易成本经济学和交易理论的发展中作为一条公理，表明如果对效率是必要的，无论何时交换都会发生。这个效率公理在纳什交易解、Kalai-Smorodinsky解、shaply值、甚至是科斯定理的推导中是清晰的。 对效率公理的质疑部分是基于不完全信息交易。毕竟卖家倾向于夸大物品的成本，买家倾向于假装他的估值很低。难道我们希望这些夸大其词致使错失交易机会？夸大其词在交易中是一个基本问题吗？可以设计一个交易机制或协议来消除夸大其词的动机吗？如果可以，它将如何工作？ 为了评估答案，我们使用一个简单的单个不可分物品出售模型。有一个潜在的买家和一个潜在的卖家对应的估值分别为和。在拟线性偏好中，当，他们都可以从交易中获益。令和表示买家和卖家在机制均衡时的payments，其中type profile为。我们假设和是光滑有界的，以致可以应用包络定理。 pivot机制(VCG机制中的)似乎是解决问题的可信候选项。它表明当报告的估值满足时，交易应该发生，转移应该进行。When trade takes place,the seller receives a payment of while the buyer pays . 用这种方式决定payment，买家和卖家都会发现如实报告他们的估值总是最优的，不管其他人如何报告。这里有一个预算赤字，因为无论交易什么时候发生我都有。在第2章时，我们观察到，通常，没有VCG机制总是能够准确平衡预算。这是一个严重的问题吗？存在一些机制在一个Bayes-Nash均衡处能够既实施有效率结果又能实现预算平衡吗？ Myerson-Satterthwaite定理表明，在某些条件之下，没有机制能够使得决策性能函数总是最大化全部价值。这个理论采用Bayes-Nash均衡的solution concept. 定理 3.6 (Myerson-Satterthwaite定理) 在定理3.3假设之外，假设参与者和设计者有相同的prior belief:.进一步假设，types是统计独立的，并且和是连续可微的。考虑任意交易机制和Bayes-Nash均衡，(1)恰好时，交易发生在均衡处，(2)type 1的卖家与type 0的买家不能交易，(3)没有交易发生就没有payments。那么机制在交易中的期望支付赤字等于期望收益。整个期望支付满足 3.3.6 Jehiel-Moldovanu 不可能定理 J&M(2001)应用收益等价论证当参与者不具有private values时，机制去实施有效率分配时的限制。没有private values假设，一个竞标者可能知道一些东西，这些东西如果泄露，会影响其他竞标者的选择。 一个用来阐述genaral possibilities的例子是逆向选择中的经典二手车模型，二手车主拥有关于车况的private information. 卖家的信息某种程度上能够影响买家是否在某个价位购买的决策。部分由于这个原因，卖家试图令买家信服他出售这辆车的动机不是因为车况不好。举个例子，卖家的广告可能包含这样一段\"Moving,must sell\"/\"手慢无\"。 举一个拍卖相关的例子，假设城市外部有一块地要出售。参与者1是一个开发商，计划在这里建一个购物中心来吸引郊区的顾客。参与者2是一个矿业公司，对地表下可能的矿床感兴趣。这块地作为购物中心的价值也取决于是否会被吵闹肮脏的采矿作业使用（有时候矿业公司比开发商了解更多）。给定这块地之于开发商的价值取决于矿业公司持有的信息，存在能够有效率分配这块土地的机制吗？ 我们从出售单个项目的interdependent values model开始，为了允许每一个竞标者都拥有其他竞标者信息的可能性，我们通过一个N-vector 来表示每一个竞标者type，其中表示竞标者拥有的关于竞标者对于项目估值的信息。we take the components of the type profile to be jointly distributed according to a atomless distribution on . 竞标者的类型，假设是统计独立的。为了使分析更加简单，我们指定对于竞标者的项目full information value为. 首要的问题是确定是否有一些聪明的支付方案使得结果在事后均衡中具有有效率的分配性能。这意味着每一个player 的策略仅应取决于他自己的type ，但是对于type profile 的每一个实现，strategy profile 应该是一个纳什均衡。solution concept的优势将在第5章讨论。 因此假设有一些分配性能在事后均衡中实施，其中是项目分配给竞标者的可能性，是对应的payment。那么给定，每一个竞标者将会给所有其他竞标者策略以最好的回应。将包络定理的积分形式应用于一维参数，竞标者的均衡收益会被实现，当类型向量满足 即， 定理 3.7 在出售单个物品的相互依存价值模型，假设 depends non-trivially on .那么没有机制在一个事后均衡处实施分配性能. 定理 3.8 令为一个分配性能函数，并且假设函数 depends non-trivially on 。那么没有机制可以在一些Bayes-Nash均衡处实施. 3.3.7 Myerson & Riley-Samuelson 收入最大化拍卖 在本节中，我们回到Myerson(1981)提出的最优拍卖问题。一个相似的拍卖收入最大化理论同期被Riley和Samueson(1981)独立发展，但是这个理论局限于竞标者具有symmetrically distributed values(估值对称分布)。Myerson最初的证明依赖于relevation principle(显示原理)局限于direct incentive-compatiable mechanisms，但是这里我们用包络定理的积分形式来简化他的分析。 考虑单个物品拍卖，其中每个独立个体个体的估值是，每一个是一个严格递增连续可微函数，并且types是独立的uniformly distributed(均匀分布)。注意这些假设并非暗示估值是identically distributed(同分布)：被函数给定的估值分布是严格递增、光滑、有界的分布。 定义 1. 一个参数机制是voluntary，如果对于每一个player 和type ，最大期望效用满足 （其中非参与者的效用归一化为零）。 2. 参数机制中的期望收入为 3. 参数机制是期望收入最大化的，如果对于任何其他的voluntary参数机制有 对于下一个定理，我们将单个获得项目的写作，其它为是便利的。 定理 3.9 考虑一个出售单个物品的标准独立私人价值模型。对于每一个，定义（边际收入作为一个价格函数），并且假设是一个递增函数。进一步假设. 那么一个参数机制是一个收入最大化机制，如果他满足并且有如下的决策性能函数： 再则，至少存在这么一个机制。 3.3.8 McAfee-McMillan Weak-Cartels定理 McAfee和McMillan(1992)是第一批去研究bidding rings理论的，这个理论研究一组竞标者达成关于如何划分拍卖中拍卖品的串通协议。Ring成员们可能会试图在拍卖之前达成他们中谁是赢家，其他竞标者可能会放弃竞标或者低价竞标。在这种情况下，赢家可能会以很低的价格得到拍卖品，从另一个方面来看，这提高了他们的利润。 Rings面临一些列问题，即使他们可以有效率的操作。第1个问题是强制协议，在拍卖中威胁报复那些违背ring规则的人。第2个问题是当拍卖价格还很低时，阻止新的竞标者进入。第3个问题是如何划分红利，这是一个非常严重的问题，正如McAfee与McMillan所讲的那样，大多数美国法务部门的竞标垄断(bid-rigging)定罪始于一个卡特尔成员因为不满自己所分得利润而转向另一个卡特尔组织。为了避免留下会被证明有罪的记录，卡特尔经常避免成员之间的现金支付，这些约束限制了卡特尔成员的成就。 我们把不能在成员之间使用现金支付的ring称为weak ring。有人可能认为，ring成员能够举行讨论并且缝合他们的交易来获取信息优势，绝对会经常按对他们最高价值情况下分配物品。这个问题的复杂之处在于没有side payments来分配利润，竞标者们仅有少量的动机去暴露他们的信息，即使对于ring成员。McAfee和McMillan表明，在一个确定的条件之下，一个弱卡特尔不能从它的成员中获取任何有用的信息，它不能比在成员间进行随机分配更好。 在我们的McAfee-McMillan模型处理中，我们假设卖家设置一个底价(reserve price) ,当且仅当竞标者的估值在或以上时才表示兴趣。Types满足在区间上的独立均匀分布，并且的估值由给出，其中.给定ring设计的参数机制，令表示具有类型的竞标者获取拍卖品的概率，并且令。一致随机分配(corresponding random allocation)是指在忽略类型向量的情况下将拍卖品以概率分配给竞标者。这种随机分配是确定可行的，对于初始机制(original mechanism)是一样的。因为一个type zero参与者没有可能获取一个正利润. 正如Vickrey首先观察到的，必须是不递减的，如果不是，那么一个竞标者会‘修改’竞标者和类型之间的关系，以使他的期望支付不变而增加. 定理 3.10 考虑一个对于单个物品的标准独立私人价值模型，并且假设是一个递减函数。那么weak ring在成员之间分配资产的任何机制对于所有的竞标者来说是事先通过非常不同于随机分配的一致随机分配控制的。 3.3.9 顺序拍卖与weber的鞅定理 在本节中，我们调查当几个同样的拍卖品在同一时间、按顺序出售，且每一个竞标者只能买一件拍卖品时所展现的价格模式。我们发现如果在每一次出售之后宣布价格，那么价格序列会形成一个鞅。这意味着第个拍卖品的期望价格等于第个拍卖品的价格。顺序拍卖的这个性质在下面的应用令人关注，经验表明艺术品和酒类拍卖中的实际价格与这个预测相违背：它们遵循一个递减模式。 为了公式化这个问题，假设存在个相同的拍卖品和个竞标者，并且每一位竞标者被限制只能获取一件拍卖品。这些拍卖品按顺序拍卖的方式拍卖，规则为价高者得且只有赢家付款。我们把拍卖规则写成这样，给定可能在件拍卖品被出售后可能有价值的任何信息，存在一个对称增长的均衡竞标函数，且此函数应用于针对第件拍卖品的竞标。那么在均衡情况之下，最高类型竞标者赢得第一件拍卖品，第二高类型竞标者赢得第二件拍卖品，如此继续。 令表示为第件拍卖品所支付的价格，表示竞标者类型按降序排列的顺序统计，并且表示空信息。 定理 3.11 任意拍卖博弈中的任意均衡满足上面描述的条件，价格序列和信息满足。如果拍卖是first-price auction或second-price auction并且是过去价格序列，那么是一个鞅。 3.3.10 Matthews定理：风险厌恶收益均衡 在上面研究的模型当中，竞标者的收益是预期得到价值(expected vaule received)减去预期支付额(expected amount paid)。这个说明包含两种关于竞标者偏好的假设。第一个是在不确定之下没有选择上的wealth effects:通过向竞标者课税来改变他们的wealth或者在他面临一个风险选择之前给予他一个转移支付不会改变他最偏好的选择。特别的，财富转移不影响竞标者的决策；第二个每一个竞标者对于涉钱投机方面是风险中性的。 Matthews(1983)研究买家具有风险厌恶的那些没有表现出wealth effects偏好的拍卖。正如在风险中立的情况之下，一个简单分析的关键之处在于使用包络定理来获取对竞标者收益的简单限制。在这种情况之下，我们发现在某个确定的层面中，竞标者在拍卖设计中的期望效用不能改变。即竞标者与设计毫不相关。 为了简化分析，我们normalize失败竞标者的效用收益为零，并且令表示竞标者的绝对风险厌恶常数。当获胜时，他的效用收益为，其中，且 定理 3.12 考虑一个拍卖博弈，其中竞标者收益显示常绝对风险厌恶，正如上面特别指出的那样。假设是具有full performance 博弈的一个Bayes-Nash均衡，其中type 0的竞标者总是失败的，并且失败的竞标者的支付总是零。定义。那么，具有type t的竞标者的均衡期望效用为 特别的，具有相同决策性能函数的两个拍卖博弈，指明(specify)相同的期望想用给每一个竞标者的每一个类型。 结论 暂无。","permalink":"https://lihanx.com/blog/34292.html","photos":[]},{"tags":[],"title":"putting_auction_to_work-2","date":"2020/11/09","text":"第一部分 机制设计方法 将机制设计的理论和方法应用于拍卖设计问题。这里有三个基本概念：机制（mechanism）、环境（environment）、性能（performance）。机制设计中有两个主要的问题：信息问题和承诺问题。因为信息问题与拍卖的相关性更高，本书主要聚焦于信息问题。 拍卖模型的3个主要部分：潜在的竞标者、资源信息和分配方式、分配给每一个参与者资源的价值。关于机制设计有3个重要的早期贡献：William Vickrey拍卖设计、Vickrey-Mirrless最优税收设计、Clarke-Groves最优公共物品供给分析。Roger Myerson第一次将机制设计应用到拍卖理论中。 机制设计模型的程序 模型有两个部分：环境和机制。 最简单的情况，环境是一个三元数组(N,Ω,Θ)。N={1,…,n}是一个参与者列表；Ω是可能outcomes集合；Θ=Θ¹×Θ²×…×Θⁿ是type profiles集合。,参与者i的类型索引参与者的信息、信仰和偏好。 type profiles和outcoms可以结合在一起表示个人收益。，因此，表示参与者i在outcome为，type profile为下的收益或效用。 收益还依赖于其他的类型。著名的Nobel经济学奖获得者乔治·阿克洛夫的柠檬市场中提到的逆向选择可以解释这种现象。尽管逆向选择已经存在于拍卖理论中很长时间了，但大部分的拍卖理论还是选择放下逆向选择而聚焦于private-value情况，此时，每一个参与者的效用仅取决于他自己的类型。除非有特殊的说明，本书处理的模型仅限于private-value情况。 大多数的机制模型都假设参与者不确定其他参与者都知道什么。在贝叶斯模型中，条件概率分布描述了一个参与者的beliefs，其仅取决于参与者自己的类型。但是本书中使用Harsanyi doctrine，beliefs源于一个common prior分布，这样做可以排除betting pathologies。 有时候为了方便，我们将type profile写作，表示除了之外其他参与者的类型。机制是一个二元组，是可能的strategy profiles 集合（表示一个player 的可能策略集合），将strategy profiles 映射到outcomes。 我们定义一个对应的策略形式game，来处理机制和类型向量，是一个包含players集合，strategy profiles集合，payoff function的三元组，收益函数将strategy profiles映射到payoff中。 给定一个机制，如果game的理论solution concept 预测一个特殊的strategy profile 将会be played。那么我们就可以使用理论concept的预测来预测和评估机制性能。机制的performance function是。性能函数将type profiles映射到outcomes。 当一个game有多个解时，我们定义参数机制argumented mechanism，为一个推荐解。推荐解表示机制设计者对参与者的一个推荐。如果这个推荐与能够充分捕捉到参与者激励的solution concept保持一致，然后没有参与者会拥有源自推荐的激励，那么是一个关于参与者如何行动的合理预测。 当是根据solution concept得到的解时，我们说或的implements性能为。换句话说，机制的均衡结果为。 第2章 Vickrey-Clarke-Grove 机制 VCG分析已经成为一个重要的标准，在后面的章节中我们会发现VCG理论和拍卖理论的其他部分有很深的联系。 2.1 公式化 表示参与者集合，其中0表示机制操纵者。表示可能的决策集合，元素通常用表示。表示outcome，表示决策，表示参与者支付向量,支付向量中的元素可正可负。 每个参与者根据结果的收益是做决策的价值，用下面公式表示为 我们可知做决策的价值仅仅取决于自己的类型,这种特殊的拟线性效用函数在本章的规范化分析中扮演不可或缺的角色。 Quasilinear Utility: Quasilinear utility functions are linear in one argument,generally the numeraire(计价单位),and strictly concave for the other arguments. 拟线性效用假设暗示竞标者可以进行任意的现金转移。在机制设计中，拟线性效用确保代理人可以通过side payments补偿其他人。 performance表示将environments映射到outcomes。我们之前将outcomes描述为两个部分，我们现在也可以将performance描述为两个部分：decision performance，将types映射到决策；transfer performance，将types映射到payments or transfer。当决策分配物品时，我们也可以将称为allocation performance。 VCG分析有时企图在满足transfer总和为零的约束下实现有效率的performance。给定上文描述的假设，如果decision 能够最大化，那么它是有效率的。 有些时候机制设计者想要在的情况下运行一个拍卖，此时意味着There is never any net transfer to the auciton designer。这些balance-budget机制是非常有用的。 VCG机制是incentive-compatible direct机制，这意味着；strategy profile 是均衡的。第一个条件表示每一个参与者都必须report一个可能的type给机制操控者。第二个条件表示无论我们选择何种solution concept，Truthful report 一个人的type是一个均衡。对于VCG机制我聚焦于dominant-strategy implementation，所以相对的，solution concept就是每个参与者plays a dominant strategy。 incentive-compatible direct机制的一项诉求是避免参与者有进行复杂策略计算的需要。Truthful report符合每一位参与者的利益。例如second-price sealed-bid auction就是一种dominant-strategy incentive-compatible direct机制。 VCG机制操控者使用reported types来计算最大化总和价值和对应的决策 很多人认为使用如此直接的方式会导致失败，因为每一个参与者似乎都有动机去误报偏好来影响决策。事实上，参与者的动机不仅取决于决策，也取决于cash transfer。 为了捕捉参与者的report对于outcome的影响，我们引入一个假设null report，表示参与者report他的决策是中立的，并且只关心transfer。除了以外的部分记为，其中，表示机制设计者，他的收益是机制的纯收益。当参与者做出null report时，VCG机制的最优决策为，对应剩余参与者的全部收益为，又因为机制设计者可以从参与者中获得一个payment ，因此，如果参与者做出null report，在集合中的参与者的全部收益为 假设reported type profile为，的payment为。所以，是的additional payment。决策通常会取决于的report，因此，集合的全部收益为，现在取做出null report，我们有 即， 即， 根据(2.4)，如果参与者的report导致决策发生变化，那么需要额外支付来补偿中成员的损失。 定义 1.一个Vickrey-Clarke-Groves(VCG)机制是一个direct机制，其中满足(2.1),满足(2.4)，payments由决定。 2.如果，那么这个参与者是关键的。 3.当对于所有成立时，VCG机制就成为了pivot 机制（关键机制）。 2.2 总是最优和弱显性策略 在这一节中，我们要验证VCG规则，来确保无论其他参与者的report如何，Truthful report对参与者总是最全有的。我们也会论证truthful report通常是一种显性策略，也是仅有的一种可以总是最优的策略。 显性策略是博弈论中的概念，主要包括两类： 严格显性策略：一个严格显性策略总是为player提供一个更大的效用，无论其他player的策略是什么。 弱显性策略：一个弱显性策略总能为player提供一个至少和其他player同等的效用，并且此策略比总是比其他策略的效用更大。 有些truthful report情况尽管对VCG机制总是最优的，但不是一个显性策略。例如，一件物品成本是200元，第一个人的价值评估为300元，第二个人的价值评估为150元，那么第一个人的report价格在区间，第二个人的report价格在区间，根据VCG机制，第二个人的report对实际结果没有影响。 满足条件(1)，truthful reporting是一个总是最优的策略。 满足条件(1)(2)，truthful reporting是一个显性策略。 (1)对于所有的，有 (2)如果，然后对于一些，有 为了排除一些特定的例子，我们使用下面的条件： All reports are petentially pivotal: 对于所有的并且，存在，使 定理2.1 在任意的VCG机制中，truthful reporting是一个always optimal策略。如果所有的report是potentially pivotal，那么truthful reporting是一个dominant策略。 2.3 平衡预算 在公共物品应用中，设计者可能想要确保除了机制操控者外所有参与者的payment总和为零。这种情况被称为balancing the budget。 这种情况下，机制设计者对于决策没有独立的价值，所以我们的模型变为 定义：一个直接机制满足预算平衡，如果对于所有有限集并且所有的，全部的transfer和为零。 预算平衡的一个必要条件是存在函数，对所有的，有 定理2.2 存在一个VCG机制满足预算平衡当且仅当存在函数使公式(2.5)成立。 2.4 唯一性 VCG以外的机制可以使用dominant strategy做出有效率的决策吗？答案是这取决于关于环境的一些额外的假设。 定理2.3 假设对于每一个，有（或者说是smoothly path connected）并且对于每一个决策结果，有关于第二个参数可微的，那么任何有效率的incentive-compatible direct机制是一个VCG机制。 一个集合是smoothly path connected，如果对于集合中的两个点存在一个可微函数使 2.5 Vickrey拍卖的缺陷 Vickrey拍卖的缺陷主要分为三个部分，practical disadvantages，monotonicity problems，mergerinvestment disadvantages。 2.5.1 实用缺陷 Vickrey拍卖会向竞标者的计算能力课以重税； Vickrey拍卖没有考虑真实的竞标者经常面对严重的预算限制； Vickrey拍卖可能会促使获胜的竞标者透露太多信息。 2.5.2 单调性问题 事实上，决定支付额的竞标者估值函数是非单调的。 在Vickrey拍卖中，(1)增加竞标者可能会降低均衡收益(2)当竞争充足时，收益可能为零(3)甚至失败的竞标者可以拥有有利的联合偏差，因为增加出价来赢得竞标的同时为他们自己创造出更低的价格(4)竞标者可以通过雇佣竞标者增加竞争来降低价格。 2.5.3 并购&投资缺陷 Vickrey拍卖会在拍卖之前扭曲竞标者的投资和并购动机，导致拍卖无效率。","permalink":"https://lihanx.com/blog/17717.html","photos":[]},{"tags":[],"title":"putting_auction_to_work-1","date":"2020/10/28","text":"第一章 Getting to work 书名：putting auction to work 作者：Paul Milgrom Milgrom与他的老师Robert Wilson共同获得2020 Noble prize in economic，奖励他们对新的拍卖制度设计的贡献 这一章是作者关于拍卖设计的经验 1.2 多目标设计 拍卖设计需要基于大量的公开记录。Kwerel提出了一个复杂的拍卖规则，最终形成了一个Milgrom-Wilson-McAfee规则，来进行Simultaneous Multiple Round Ascending auction(SMRAA)同时多轮增价拍卖。 SMRAA在许可证之间互为替代品时是最好的理论设计。（经验表明，频谱许可证之间很接近替代品） 1.2.1 替代品和互补品 拍卖的目的是将货物分配给投标者。在最初的PCS拍卖中，有三个潜在的投标团体。 没有无线业务的长途电话公司，希望获得能够覆盖全美的许可证。（相关公司：MCI,Sprint） 已经存在的无线公司，希望获取更多的许可证扩大它们的覆盖范围。（相关公司：AT&T） 没有无线业务的新参与者，希望获取覆盖大范围地区的许可证，但不用覆盖全美。(相关公司：Pacific Bell in California) 影响效率的几个障碍： 1.证书规格约束 2.涉及大量难以捉摸的复杂细节 3.投标者们的信息不完善 其实，影响效率的最大障碍是Packaging problem。（许可证的价值对于投标者来讲并不是固定的） 例子：考虑两个许可证，当一个投标者拥有一个许可证后，对第二个许可证只愿意付较低的价格，那么这两个许可证互为替代品；当一个投标者拥有一个许可证后，对第二个许可证愿意付较高的价格，那么这两个许可证互为互补品。 1.2.2 新泽西州的频谱权限拍卖 新泽西州采用second-price sealed-bid auction.这种方法适合于单个物品拍卖，当拍卖多个物品，并且这些物品有依赖关系时，这种拍卖方式并不是很有效率。 1.2.3 更好的拍卖设计 模仿Dutch flower auction。 第一轮赢者，可以用他的竞价获得任意多他想要的物品，如果有剩余进入下一轮，无剩余则拍卖结束。 1.2.4 FCC设计及成果 所有许可证一起竞价，促使完全替代品具有相同的价格。 为了防止竞标者陷入局部许可证竞拍，使用activity rule.activity rule主要包括两部分内容eligibility(资格)和activity(活动)。 activity指在任意一轮竞标中，新增投标许可证数量或其实高报价许可证数量。规则指定一个竞标者在一轮的全部activity不能超过它的eligibility。 一个竞标者在第一轮的初始eligibility，通过递交申请和缴纳押金确立；其他轮次取决于最近的竞标activity。（如果竞标者本轮没有activity;那么他就会失去下一轮的资格） SMRAA的变体---clock auction 当前价格在clock上标明，此时每一个竞标者竞标自己需要的数量。刚开始由于价格较低供给量小于需求量；当价格升高，需求量降低，以至于供给量等于需求量时，拍卖结束。 SMRAA的变体---EDF(Electricite de France) auction 不同期限长度的电力电力合同拍卖。规定价格是指每月每百万瓦特的电力价格。 不同时间长度的合同价格不同。例如，3个月合同的价格总是高于6个月合同的电力价格2139欧元，其他长度的电力合同同理。 给定一个较低的起始价格，然后升高价格，耗尽剩余需求，结束拍卖。 1.3 比较销售者利润 对于哪种拍卖方式可以获取更高利润的问题。一个有力的回答是：无论是密封投标还是开放式投标都没有系统性优势。这个回答的理论依据是---payoff equivalence theorem(收益等价理论) 1.4 学术争论 从一个想法到理论再到应用于实践，这个过程会遇到很多问题，很多争论。 1.4.1 转售和科斯定理 很多人认为拍卖根本就不是一个问题，政府拍卖的唯一目的就是赚钱，他们的理论依据是科斯定理。 科斯定理表明，无论分配是多么无效率，一部分人为了利益会继续进行交易，进而消除这种无效率。但是科斯定理的假设是“零交易成本”，实际经验表明在美国的无线许可证交易市场上，由于初次分配造成的无效率并不能被市场交易很快的纠正。 在机制设计中的Myerson-Satterthwaite理论可以解释上述现象。它的结论如下： 交易双方各自拥有关于物品的秘密和可能不同的价值评估，且都想要无风险的强迫另一方接受交易损失，这样的交易是无效率的。 换一句话来说，关于物品价值的私人信息阻碍交易。 1.4.2 机制设计理论 机制就是用一系列规则来管理成员之间的交互。在现实生活中，有用的机制一定要具有稳健性。 尽管机制设计有很多脱离实际的缺点，这本书也会花费大量的篇幅聚焦于机制设计和相关分析。因为这个理论对于在实践中识别问题及影响很有帮助。 1.4.3 理论和实验 与机制设计的纯粹主义者相反，一些经济学家直接用实验来测试拍卖设计。 理论和事实哪个重要？理论源于事实。 1.4.4 实际问题 实际运行中会遇到很多问题，这里选两个例子。 第一个问题关于市场，没有参与者的拍卖是不可能成功的，好的拍卖设计就是要吸引更多更合适的参与者。 第二个问题是担心产权分配。例如，拥挤机场的起飞权和着陆权，中间飞机可能有各种延误或故障，影响机场效率。忽视产权的界定是不可能成功的。 拍卖制度设计要考虑方方面面，运用理论来指导实际拍卖的设计。","permalink":"https://lihanx.com/blog/17525.html","photos":[]},{"tags":[],"title":"论政府","date":"2020/10/27","text":"论政府 政府存在的意义：用权利剥夺权利。","permalink":"https://lihanx.com/blog/51806.html","photos":[]},{"tags":[],"title":"http-live-streaming介绍","date":"2020/10/26","text":"http live streaming 介绍 HLS在互联网上提供一个可靠低成本的连续、长视频传输方式 一、Media Segments 一个media segment被URI和可选字节范围指定；每一个media segment的时长被media playlist的EXINF标签指定。 1.1 Media Segment支持的格式 Media segment在被解析之前，要初始化解析器，这个阶段叫做Media Initialization Section。用EXT-X-MAP标签来指定。 1.2 MPEG-2传输流 MPEG-2传输流segment的Media Initialization Section==Program Association Table(PAT)+Program Map Table(PMT) 1.3 fragmented MPEG-4 fragmented MPEG-4(fMP4)的Media Initialization Section==FileType Box+Movie Box 每一个fMP4 segment在Media playlist中必须有一个EXT-X-MAP标签 1.4 Packed Audio[音频] Packed Audio 没有Media Initialization Section，Packed Audio Segment==encoded audio samples + ID3标签。 1.5 webVTT[字幕] webVTT segments 搬运字幕；webVTT segment的Media Initialization Section是webVTT header 二、Playlist 每一个Playlist文件必须要有一个定义的路径组件，要么是URI，要么是HTTP Content-Type。 2.1 Playlist中的定义 Playlist在UTF-8定义下解码； 每一行要么是URI，要么是空白行，要么以#开头； 以#开头不是注释就是标签； 以#EXT开头的是标签； 一个URI行识别一个Media Segment或Playlist文件。 2.2 属性列表 某些具有‘值’的标签组成属性列表； 属性名有26个大写字母或数字‘0-9’或‘-’组成； （属性名=属性值）中间不能有任何空白。 2.3 Playlist标签 Playlist标签要么是指定全局参数，要么是指定media segment 或 media playlist中的信息。 2.3.1 基础标签 EXTM3U EXT-X-VERSION EXTM3U,表示这是一个Extented M3U Playlist file。 Its format is: #EXTM3U EXT-X-VERSION,除非兼容第一个版本，否则这个标签必须出现，1个Playlist文件有且仅有一个此标签。 Its format is: #EXT-X-VERSION: 2.3.2 Media Segment 标签 每一个Media Segment被一系列Media Segment标签及其后的URI所指定。 Media Segment标签一定不能出现在Master Playlist. A playlist is a media playlist if all URI lines in the playlist identify Media Segments. A playlist is a master playlist if all URI lines in the playlist identify Media Playlists. 一个Playlist 要么是media playlist,要么是 master playlist. EXTINF EXT-X-BYTERANGE EXT-X-DISCONTINUITY EXT-X-KEY EXT-X-MAP EXT-X-PROGRAM-DATE-TIME EXT-X-DATERANGE EXTINF,指定media segment的时长上限（适用于3以上版本）。 Its format is: #EXTINF:,[] 时长,值为十进制浮点数。 EXT-X-BYTERANGE,指定一个media segment是URI识别资源的一个子范围（适用于4以上版本）。 Its format is: #EXT-X-BYTERANGE:[@] 字长，值为十进制整数，表示子范围字节长度。 当media segment包括的URI识别整个资源时，此标签不应该出现。 EXT-X-DISCONTINUITY,表示两个media segment的非连续性。 以下几点发生变化，此标签必须出现： 1.文件格式； 2.数字，类型，indentifiers of tracks. 3.timestamp sequence 以下几点发生变化，此标签应当出现： 1.编码参数 2.编码序列 EXT-X-KEY, media segment可能被加密，此标签表示如何解密。（作用域范围是从此标签开始到下一个EXT-X-KEY标签或文件尾结束） Its format is: #EXT-X-KEY: METHOD,表示加密方式，有NONE，AES-128, SAMPLE-AES URI,值类型为quoted-string,表示如何获取密钥。 IV,值类型为十六进制序列，值为128位无符号整型初始化向量，适用于2以上版本。 KEYFORMAT,指明密钥在被URI所识别资源中如何表示。默认值是“identify”。（可选项，适用于5以上版本） EXT-X-MAP,指明如何获取被请求的media initialization section来解析media segment。（作用域为从此标签到下一个EXT-X-MAP标签或文件尾）（适用于5以上版本） Its format is: #EXT-X-MAP: URI,一个包含URI的quoted-string，此URI识别包含media initialization section的资源（必选项）。 BYTERANGE,值类型为quoted-string,指明被URI属性识别的资源的字节范围。默认字节范围是整个被URI识别的资源。（可选项） EXT-X-PROGRAM-DATE-TIME,将一个绝对日期或时间与一个media segment的first sample关联在一起。 Its format is: #EXT-X-PROGRAM-DATE-TIME: 日期-时间-秒,是ISO/IEC 8601:2004 date/time表示。 例子： #EXT-X-PROGRAM-DATE-TIME:2010-02-19T14:54:23.031+08:00 EXT-X-DATERANGE,将一个时间范围和一系列属性关联在一起。 Its format is: #EXT-X-DATERANGE: ID，值类型为quoted-string，识别一个playlist中的日期范围。（必选项） CLASS，值类型为quoted-string,为客户端自定义。（可选项） START-DATE,值类型为quoted-string,表示时间范围的起始日期。（必选项） END-DATE,值类型为quoted-string,表示时间范围的终止时间。（可选项） DURATION,值类型为十进制浮点数，表示时间范围的长度，以秒为单位。（可选项） PLANNED-DURATION,值类型为十进制浮点数，表示在一个时间范围的时长未知情况下的期望时长。 X-，客户端自定义属性。（可选项） END-ON-NEXT,值类型为enumerated-string且必须为YES，END-ON-NEXT=YES属性必须和class属性同时出现。（可选项） 如果playlist包含一个EXT-X-DATERANGE标签，那么它一定包含至少一个EXT-X-PROGRAM-DATE-TIME标签。 如果语法错误，客户端会忽略此标签。 2.3.3 Media Playlist标签 一个media playlist标签一定不能出现在master playlist中。 EXT-X-TARGETDURATION EXT-X-MEDIA-SEQUENCE EXT-X-DISCONTINUITY-SEQUENCE EXT-X-ENDLIST EXT-X-PLAYLIST-TYPE EXT-X-FRAMES-ONLY EXT-X-TARGETDURATION,表示最大media segment时长。（必选项） Its format is: #EXT-X-TARGETDURATION: 最大时长，值类型为十进制整型，单位为秒。 EXT-X-MEDIA-SEQUENCE,表示出现在playlist文件中第一个media segment的序列号，默认为0。 Its format is: #EXT-X-MEDIA-SEQUENCE: 序列号，值类型为十进制整型。 此标签一定出现在playlist中第一个media segment前面。 EXT-X-DISCONTINUITY-SEQUENCE,默认为0，且必须在EXT-X-DISCONTINUITY标签之前。 EXT-X-ENDLIST,表示不再有media segments加入到media playlist文件中。（应选项） Its format is: #EXT-X-ENDLIST EXT-X-PLAYLIST-TYPE,提供media playlist文件的易变性信息。（可选项） Its format is: #EXT-X-PLAYLIST-TYPE: 类型，值类型为enumerated-string,且值要么是ENENT，要么是VOD。 ENVENT表示media segments只能加入到media playlist的尾部。 VOD表示media playlist不能改变。 EXT-X-I-FRAMES-ONLY,表示在playlist中的每一个media segment描述一个单个的I-frame。I-frame可以用作trick play,such as 快进、rapid reverse、scrubbing。（适用于4以上版本） Its format is: #EXT-X-I-FRAME-ONLY 2.3.4 Master Playlist 标签 master playlist标签不能出现在media playlist中。 EXT-X-MEDIA EXT-X-STREAM-INF EXT-X-I-FRAME-STREAM-INF EXT-x-SESSION-DATA EXT-X-SESSION-KEY EXT-X-MEDIA,被用来关联media playlist Its format is: #EXT-X-MEDIA: TYPE，值类型为enumerated-string,且只能是AUDIO,VIDEO,SUBTITLE,CLOSED_CAPTION。（必选项） URI，值类型为quoted-string,包含一个能识别media playlist文件的URI。（可选项，且TYPE为CLOSED-CAPTION时，URI属性一定不能出现） GROUP-ID，值类型为quoted string，指明rendition所属的group。（必选项） LANGUAGE，值类型为quoted-string,识别rendition使用的语言。（可选项） ASSOC-LANGUAGE，值类型为quoted string，识别与rendition关联的语言（例如，中国话对应简体字和繁体字，简体字对应不同的方言）。（可选项） NAME，值类型为quoted string,包含对rendition的一个可读的描述。（必选项） DEFAULT，值类型为enumerated string，且只能是YES或NO，默认为NO。（可选项） AUTOSELECT，值类型为enumerated-string，且只能是YES或NO，默认为NO。如果DEFAULT=YES，且AUTOSELECT选项出现，则AUTOSELECT=YES。（可选项） FORCED，值类型为enumerated string，且只能是YES或NO，默认为NO。只有TYPE=SUBTITLE时，才能使用此属性。 INSTREAM-ID，值类型为quoted-string,指明media playlist中segments里的一段rendition.(TYPE=CLOSED-CAPTIONS时，为必选项) CHARACTERRISTICS，值类型为quoted-string，包含1个或多个Uniform Type Identifiers[UTI]用逗号分隔。每一个UTI表示一个单独的rendition characteristic。such as,\"public.accessibility.describes-video\"。（可选项） CHANNELS，值类型为quoted string，指明一个有序的，用“/”分隔的参数列表。（应选项） 如果TYPE=AUDIO，第一个参数表示audio通道数，其他参数目前还未定义。 For example, an AC-3 5.1 Rendition would have a CHANNELS=\"6\" attribute。 所有的audio EXT-X-MEDIA标签都应该有CHANNELS属性。如果一个master playlist包含两个rendition编码，且它们具有相同的codec和不同的通道数，那么CHANNELS属性是必须的，其他情况是可选的。 EXT-X-STREAM-INF,指明Variant Stream, Variant Stream是一系列rendition,这些rendition可以结合起来进行演示。这个标签的属性用来提供关于Variant Stream的信息。 在EXT-X-STREAM-INF之后的URI行，指定一个media playlist用来搬运Variant Stream的rendition。（这个URI行是必须的） Its format is: #EXT-X-STREAM-INF: BANDWIDTH，值类型为十进制整型，单位是bits per second,表示Variant Stream的峰值段比特率。（必选项） AVERAGE-BANDWIDTH，值类型为十进制整型，单位是bits per second，表示Variant Stream平均段比特率。（可选项） CODECS，值类型为quoted string，包含一个逗号分隔的格式化列表，每一个格式通过Variant Stream指明一个在1个或多个rendition中出现的media sample type。（应选项） 例子；包含AAC-LC audio和H.264 main profile level 3.0 video的流的CODECS值为“mp4a.40.2,avc1.4d401e”。 RESOLUTION，值类型为decimal-resolution，描述在Variant Stream中展示所有video的最优分辨率。（可选项，但Variant Stream中包含video时，推荐使用） FRAME-RATE，值类型为十进制浮点数，描述在Variant Stream中所有video 的最高帧率。（可选项，但Variant Stream中包含video时，推荐使用） HDCP-LEVEL，值类型为enumerated string，且只能为TYPE-0或NONE。{High-bandwidth Digital content copy protection(HDCP)高带宽数字内容拷贝保护}值为TYPE-0，表示接受HDCP保护；值为NONE，表示不接受HDCP拷贝保护。（可选项） AUDIO，值类型为quoted string，必须和EXT-X-MEDIA标签的GROUP-ID属性匹配，且TYPE属性为AUDIO。此属性指定演示时被使用的一系列audio renditions。（可选项） VIDEO，类上。 SUBTITLE，类上。 CLOSED-CAPTION，情况1，类上；情况2，值为enumerated string，且为NONE。此时所有EXT-X-STREAM-INF标签中的此属性值为NONE。表示Master playlist中的任何一个Variant Stream中都没有closed caption。 EXT-X-I-FRAME-STREAM-INF，展示在一个多媒体演示中，包含I-frames的media playlist文件中的信息。 Its format is: #EXT-X-I-FRAME-STREAM-INF: 在 EXT-X-STREAM-INF标签下的属性，基本上在 EXT-X-I-FRAME-STREAM-INF标签中也有定义，除了FRAME-RATE,AUDIO,SUBTITLES,CLOSED-CAPTIONS。此外，还有一个属性被定义： URI,值类型为quoted string，包含一个识别I-frame media playlist文件的URI。这个playlist文件必须包含EXT-X-I-FRAMES-ONLY标签。 每一个 EXT-X-I-FRAME-STREAM-INF标签必须包含BANDWIDTH属性和URI属性。 EXT-X-SESSION-DATA，此标签允许master playlist中的任意会话数据被搬运。 Its format is: #EXT-X-SESSION-DATA: DATA-ID,值类型为quoted string，用来识别特殊的数据值。（必选项） VALUE，值类型为quoted string，包含被DATA-ID识别的数据。 URI，值类型为quoted string，包含一个URI。 LANGUAGE，值类型为quoted string，包含一个识别VALUE语言的语言标签。 EXT-X-SESSION-KEY，允许来自media playlist的加密密钥在master playlist中被指定。允许客户端在阅读media playlist之前预加载这些密钥。 Its format is: #EXT-X-SESSION-KEY: 在EXT-X-KEY标签下定义的属性也在EXT-X-SESSION-KEY下定义，除了METHOD属性值一定不能是NONE。 如果使用EXT-X-SESSION-KEY标签，那么METHOD,KEYFORMAT,KEYFORMATVERSIONS这些属性的值要与具有相同URI值的EXT-X-KEY标签相匹配。（可选项） 2.3.5 Media or Master Playlist 标签 这些标签在playlist中只能出现一次；在Master Playlist中出现过的，就不应该出现在Media Playlist中。 EXT-X-INDEPENDENT-SEGMENTS EXT-X-START EXT-X-INDEPENDENT-SEGMENTS，表示所有在media segment中的meida samples 可以在不需要其他segments信息的情况下进行解码。 Its format is: #EXT-X-INDEPENDENT-SEGMENTS EXT-X-START，指定playlist中播放的起始点。（可选项） Its format is: #EXT-X-START: TIME-OFFSET，值类型为有符号十进制浮点数，指时间偏移量，单位是秒。（必选项）正值表示从playlist开始处，偏移的正时间量；负值表示从playlist的结尾处偏移的负时间量。 PRECISE，值类型为enumerated-string，且值为YES或NO。if YES，客户端从偏移量确定的起始点开始播放；if NO，客户端从偏移量确定的起始点所在的media segment的开头进行播放。默认为NO。（可选项）","permalink":"https://lihanx.com/blog/49096.html","photos":[]},{"tags":[],"title":"preface-VS-foreword","date":"2020/10/15","text":"preface与foreword的区别 preface: an introduction to a book, especially one that explains the author's aims. foreward: a short introduction at the begining of a book, typically by a person other than the author.","permalink":"https://lihanx.com/blog/17710.html","photos":[]},{"tags":[],"title":"农村住宅规划图","date":"2020/10/15","text":"农村家庭住宅规划图 以河南省为例，由于国家法律规定，农村宅基地面积由地方根据实际情况进行规划，所以和其他地区会有所不同。讽刺的是，河南省制定的农村宅基地面积标准与实际情况严重不符。河南省农村宅基地合规面积不得超过167平方米，而根据谷歌地图，我们可以清晰的测量出，绝大部分宅基地的面积大约半亩地左右（333平方米），是规定面积的两倍。 对于地方政府这种圈地行为，大概可以用张维迎教授的‘无知’、‘无耻’论来分析。我们以正常人的角度来看，全省的住宅实际使用面积调查可以说是轻而易举，不管是实地测量还是卫星测绘，该有的手段，地方政府都有，显然地方政府不是‘无知’的。地方政府为什么‘无耻’？拆迁补偿。中国正在进行人类历史上最大规模的城市化历程，农村人搬入城市，需要土地来建设住房、小区；原有的城市居民需要更大的住宅来改善自己的居住条件；城市居民开始厌恶33层楼的高密度住宅。这些现实的需求要求地方政府，合并周围地区，扩展城市边界。这一切的一切，最终都落到‘土地’上，地方政府为了获取大量廉价土地，只好对最弱势的农民出手，“有时候，老实人就是被欺负”。地方财政。众所周知，中国大多数地方政府都是实行‘土地财政’的经济政策，这项政策的基本原理很简单‘贱买贵卖’。地方政府没有强大的产业支撑，也就缺少税收基础，按照正常方式发展，地方发展速度不会太高，通过土地政策大量掠夺域内居民财富可以快速的为地方政府积累原始资本，助力该地区快速发展。从农民手里低价掠夺土地，高价卖给城市居民，这就是地方政府的生财之道。掠夺域外资源。地方政府通过土地财政获取原始资本以后，大量引进各种企业、人才，升级本地产业结构，形成正循环以后，对内可以结束‘土地财政’，反哺域内居民，对外通过资本、企业、技术、教育、医疗、安保等进行大规模掠夺。国家限制‘北京’，‘上海’的落户，其实就是限制他们对国内其他地方的掠夺，国家建立‘国家中心城市’，就是通过政策的力量让全国的掠夺中心分布的更加合理，等到这些掠夺中心完成产业升级，就可以结束‘土地财政’政策，实现社会经济的健康发展。{对于农村居民来说，千万不要贪便宜，移居到毫无特色的小城市去，可能会使家族被迫接受二次掠夺} 我的规划 1354021f84900887c.png 0o6DUK.png 0o65Uf.png 0ocFM9.png 0ocVVx.png 0oceIK.png 0ocuGD.png PDF下载链接： https://pan.baidu.com/s/1aRjLEll6tm5BZtCaZzYpfA 提取码：1234","permalink":"https://lihanx.com/blog/40276.html","photos":[]},{"tags":[],"title":"Louise_gluck","date":"2020/10/09","text":"2020诺贝尔文学奖得主——Louise Glück Louise是美籍匈牙利裔犹太人，出生于纽约长岛，从小就深受家庭影响，对文学诗歌有较深的了解。从多个对她的采访中可以看出，她是一个性格温和而又敏感的人。正是这份敏感，不仅给她以对文学、对诗歌、对生活有超出常人的理解，也让Louise在青少年和青年时期深受精神方面的困扰。 对Glück这个名字发音的兴趣 很明显，英语中根本就没有ü这个字母，也没有相对应的发音。在德语、匈牙利语和拉丁语中有这个字母，巧合的是在汉语的发音中也有这个字母。汉语中ü的发音和匈牙利语中ü的发音是一致的/yu/，因此，一些中国人把Glück这个名字翻译为‘格吕克’。 然而，事情并不这样简单。只有26个字母的英语，无法发出/yu/的音，所以他们就找了一个比较相似的音/I/来代替。这对于讲英语的人士是可以接受的，毕竟不同语言音译大致相同就可以了，但是，一些中国人直接通过英语发音译为汉语中的/i/，所以Glück这个名字就被译为‘格丽克’、‘格利克’。 这件事还没有结束。英语中根本没有ü这个字母，所以Louise Glück的英文名字应该是Louise Gluck。然后按照英语发音读出这个名字就像中文的‘格鲁克’，所以Gluck这个名字就被译为了‘格鲁克’。 我在YouTube看了几个关于Louise Glück的采访视频，有的叫她‘格利克’，有的叫她‘格鲁克’。我的观点是：无所谓了，反正我们大多数人都见不到她，想怎么读就怎么读；如果有机会见到她，就问一下，“你的名字怎么读？”。 对Louise Glück 诗歌的理解 显然，我对西方的诗歌并不了解，就是她诗歌里的英文单词我都认不全，更谈不上理解了。培养对于诗歌的感觉，需要花费大量的时间，最好就是在孩童时期。长大了，就有很多身不由己，没时间、没心情去做了（其实就是懒）。不可否认，我要在这里做一个附庸风雅的人。这里摘录她的一首有名的诗《The Wild Iris》 At the end of my suffering there was a door. Hear me out: that which you call death I remember. Overhead, noises, branches of the pine shifting. Then nothing. The weak sun flickered over the dry surface. It is terrible to survive as consciousness buried in the dark earth. Then it was over: that which you fear, being a soul and unable to speak. ending abruptly, the stiff earth bending a little. And what I took to be birds darting in low shrubs. You who do not remember passage from the other world I tell you I could speak again: whatever returns from oblivion returns to find a voice: from the center of my life came a great fountain, deep blue shadows on azure seawater. Louise Glück于2004年出版的诗集 链接：https://pan.baidu.com/s/1bR9V1niAed__e9bEMaUgKg 提取码：1234","permalink":"https://lihanx.com/blog/38433.html","photos":[]},{"tags":[],"title":"python的字符串和编码问题","date":"2020/09/13","text":"python的字符串和编码问题 在计算机内存中，统一使用Unicode编码，当需要保存到硬盘或者需要传输的时候，就转换为UTF-8编码 ord()函数获取字符的整数表示，chr()函数把编码转换为对应的字符 ord('A') chr('48') python的编解码 python在内存中的字符串类型为str,如果需要网络传输或存放在硬盘中需要转变为bytes类型。 str类型可以通过编码的方法转换为bytes类型 '中文'.encode('utf-8') bytes类型可以通过解码的方法转换为str类型 b'\\xe4\\xb8\\xad\\xe6\\x96\\x87'.decode('utf-8') len()函数计算str类型字符串的字符数或bytes类型字符串的字节数。 当源代码包含中文字符或其他非ASCII码字符时，最好在源文件的头部加上 #!/usr/bin/env python3 # -*- coding: utf-8 -*- python的格式化输出 python的格式化输出的方法有三种，我们取最简单的f-string为例 >>> r = 2.5 >>> s = 3.14 * r ** 2 >>> print(f'The area of a circle with radius {r} is {s:.2f}') The area of a circle with radius 2.5 is 19.62","permalink":"https://lihanx.com/blog/63088.html","photos":[]},{"tags":[],"title":"现代西方主流经济学发展史","date":"2020/08/29","text":"现代西方主流经济学发展史 现代西方经济学起源于亚当.斯密时代，以亚当.斯密于公元1776年发表《国富论》为起点，西方经济学已经走过了快250年。以今天的西方经济学知识体系回顾亚当.斯密时代经济学家的著作，会发现当时经济学家包括亚当.斯密的一些经济学思想都是错误的。但是，瑕不掩瑜，正是经过一代代西方经济学家的不断努力，新的理论建立、错误的理论抛弃，才形成了当今的西方经济学。 16世纪-17世纪 重商主义 国家干预对外贸易&国际金融 18世纪下半叶 重农主义 自由放任（代表人物：魁奈、杜尔阁） 1723-1790 亚当.斯密 [开创古典政治经济学派] 1748-1832 边沁 [效益论] 1766-1834 马尔萨斯 [人口论、供求论] 1772-1823 大卫.李嘉图 [比较优势] 1806-1873 约翰.密尔 [古典政治经济学集大成者] 1834-1910 瓦尔拉斯 [开创洛桑学派、边际效用、均衡理论] 1835-1882 杰文斯 [边际效用] 1840-1921 门格尔 [开创奥地利学派、边际效用、主观价值论] 1842-1924 阿尔弗雷德.马歇尔 [开创剑桥学派、新古典政治经济学派] 1848-1923 帕累托 [洛桑学派、帕累托最优、二八法则] 1851-1926 维塞尔 [奥地利学派、机会成本] 1877-1959 庇古 [剑桥学派、外部性原理] 1899-1967 爱德华.张伯伦 [垄断竞争] 1903-1983 琼.罗宾逊 [不完全竞争] 1883-1946 凯恩斯 [开创宏观经济学] 1904-1989 约翰.希克斯 [IS-SM模型、消费者理论] 1915-2009 保罗.萨缪尔森 [开创新古典综合经济学派] 1912-2006 米尔顿.弗里德曼 [开创货币主义学派] 1940-？ 乔治.阿克洛夫 [信息不对称] 1943-？ 迈克尔.斯宾塞 [信息不对称、信号传递模型] 1943-？ 约瑟夫.斯蒂格利茨 [信息不对称] 1945-？ 理查德.塞勒 [行为经济学]","permalink":"https://lihanx.com/blog/3919.html","photos":[]},{"tags":[{"name":"powershell","slug":"powershell","permalink":"https://lihanx.com/tags/powershell/"}],"title":"Excution policy in windows powershell","date":"2020/08/03","text":"windows powershell 的执行策略 powershell 相比于CMD命令行有很大的优势，特别是和linux命令结合方面，powershell 可以和Linux紧密的结合起来。所以现在是全面转向powershell的时候了！ powershell在Windows平台默认是不能执行脚本的，需要自行了解excution policy。下面从excution policy权限种类、权限范围和相关命令来介绍Windows平台下powershell的excution policy。 权限种类 >AllSigned: >1.可以运行脚本 > >2.要求脚本和配置文件由可信任的publisher发布或者脚本由自己在local computer上写成 > >3.非信任来源的脚本运行给出提醒 Bypass: 运行所有脚本，没有提醒 RemoteSigned: 可以运行脚本，但需要网络下载数字签名，其中在local computer上写的脚本不需要数字签名 Restricted: 允许独立的命令，但不允许运行脚本 权限范围 >MachinePolicy: 所有使用此计算机的人（组策略） > >UserPolicy: 当前使用此计算机的人（组策略） > >Process: 当前powershell会话 > >Current User: 当前使用此计算机的人 > >Local Machine: 所有使用此计算机的人[系统默认值] 权限更改命令 获取当前会话的执行权限信息 Get-ExecutionPolicy -List 更改执行权限 Set-ExecutionPolicy -ExecutionPolicy RemoteSigned Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser 移除执行权限 Set-ExecutionPolicy -ExecutionPolicy Undefined -Scope LocalMachine 总结 一般来说，获取默认范围（local machine）的Bypass权限就可以了。 [别忘了获取powershell管理员权限] Set-ExecutionPolicy -ExecutionPolicy Bypass","permalink":"https://lihanx.com/blog/17117.html","photos":[]},{"tags":[],"title":"图床工具选择","date":"2020/07/29","text":"图床工具 因为搭建博客使用markdown工具，插入图片这种刚需就需要借助图床工具来来实现，本人大概了解了网络上的几种常用的图床工具，以下几种速度快，限制小，可以作为常用的图床工具（smms国内现在无法使用）。 imgURL图床 路过图床 smms图床 962图床","permalink":"https://lihanx.com/blog/6883.html","photos":[]}],"categories":[],"tags":[{"name":"powershell","slug":"powershell","permalink":"https://lihanx.com/tags/powershell/"}]}